{
  "backend/main.mo": "Defines the core backend actor with session, channel, message, document, player‑document, image, and file reference types and initializes storage, authorization, and ID counters.",
  "backend/migration.mo": "Provides a migration function converting old player document data to the new format by replacing the 'visible' flag with 'isPrivate'.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to frontend files, components, and test IDs with high confidence ratings.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files describing their responsibilities across the UI, hooks, utilities, and settings.",
  "frontend/index.css": "Tailwind base configuration defining light/dark theme color variables and global styling tokens including sidebar and chart colors.",
  "frontend/index.html": "HTML entry point that initializes dark mode early from local storage and loads the main React bundle.",
  "frontend/src/App.tsx": "Main React app component handling authentication, profile setup, session restoration, routing, logout cleanup, and global error boundary usage.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that displays a recovery UI with reload and local data‑clear options when an unhandled error occurs.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Chat view that displays channel messages, handles auto-scroll, and sends normal or /roll messages through the actor API.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders a chat message with avatar, timestamp, and roll highlighting, resolving user profiles for avatars.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Document editor for hosts supporting text edits, file uploads with validation, and saving via actor API.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Player-facing document editor allowing content edits and privacy toggling when the user owns the document.",
  "frontend/src/components/profile/Avatar.tsx": "Avatar component showing an image or fallback initials with size options.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "User profile picture manager handling image upload, validation, progress display, and removal.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting channels using actor API with validation and error handling.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Dialog components for creating, renaming, deleting, and locking host-managed documents using actor API calls with loading and error handling.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Provides UI to export and import session data via actor API, including file handling, confirmation dialogs, and error reporting.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Implements dialogs and menus for players to create, rename, delete, and toggle visibility of their own documents using React query mutations.",
  "frontend/src/components/session/SessionSidebar.tsx": "Renders the session sidebar listing channels, host documents, and player documents with creation buttons and per-item management menus.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Settings page allowing users to change theme, background, nickname, and manage session templates with import/export and reset options.",
  "frontend/src/config/polling.ts": "Defines polling intervals for messages, lists, session info, and document content.",
  "frontend/src/context/PreferencesContext.tsx": "Context provider for loading, updating, saving, and resetting user preferences including theme handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity and invalidates related queries when it changes.",
  "frontend/src/hooks/useDocumentFiles.ts": "Provides React Query hooks for listing, retrieving, and uploading document files using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for managing login, identity loading, and authentication state.",
  "frontend/src/hooks/usePlayerDocuments.ts": "Contains hooks for listing, reading, creating, updating, and deleting player documents with automatic query invalidation.",
  "frontend/src/hooks/usePolling.ts": "Provides a simple polling hook that repeatedly invokes a callback at a given interval when enabled.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports the usePreferences hook from the PreferencesContext.",
  "frontend/src/hooks/useSessionData.ts": "Aggregates session-related queries including session, channels, documents, messages, and selected document details.",
  "frontend/src/hooks/useUserProfile.ts": "Contains hooks for reading and updating user profiles, including the caller’s profile and profile picture removal.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes with a green-accented palette.",
  "frontend/src/lib/clearLocalAppData.ts": "Clears specific localStorage keys and all sessionStorage entries for resetting local app data.",
  "frontend/src/lib/documentFileMarkers.ts": "Utilities for creating, parsing, inserting, and removing special file marker tags in document content.",
  "frontend/src/lib/documentImageMarkers.ts": "Utilities for handling image marker tags in document content, including creation, parsing, insertion, and removal.",
  "frontend/src/lib/preferencesStorage.ts": "Manages loading, saving, and resetting user preferences in localStorage with defaults.",
  "frontend/src/lib/rollCommand.ts": "Validates simple dice roll patterns, checking for required characters and allowed format.",
  "frontend/src/lib/sessionExportFile.ts": "Creates, downloads, and parses session export JSON files with version checks and basic validation.",
  "frontend/src/lib/sessionStorage.ts": "Stores, retrieves, and clears session context data in localStorage.",
  "frontend/src/lib/templateHistoryStorage.ts": "Manages saving, loading, clearing, and validating session template data in localStorage.",
  "frontend/src/lib/time.ts": "Formats bigint nanosecond timestamps into human‑friendly date or time strings.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/LobbyPage.tsx": "UI logic for hosting or joining sessions, handling forms, errors, preferences, and template application.",
  "frontend/src/pages/SessionPage.tsx": "Displays session UI, handling channel/document selection and fetching session data.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and related sessionStorage entries.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for the project.",
  "project_state.json": "Defines the project’s current state and requirements for adding a Players' Documents sidebar section and implementing per-document privacy controls. Lists existing features, pending feature requests, and architectural notes for enforcing private document visibility."
}