{
  "backend/main.mo": "Defines the backend actor with document, session, channel, messaging, file, and image-related types and includes blob‑storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries describing UI changes to the SessionPage header along with linked files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries for major frontend files including pages, components, hooks, and utilities.",
  "frontend/docs/regression-test-plan-player-document-uploads.md": "Outlines regression tests for player‑document file and image uploads, including expected behavior, errors, and cross‑document checks.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light/dark themes and applying global background and border styles.",
  "frontend/index.html": "HTML entry point that initializes theme mode from localStorage and mounts the React app at the root div.",
  "frontend/src/App.tsx": "Main React app logic handling authentication, profile setup, session restoration, logout, and routing between Lobby and Session screens.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that catches application errors and displays a fallback UI with reload and data‑clearing options.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Chat UI for a channel supporting text, roll commands, image uploads, replies, and auto‑scrolling.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders a single chat message with avatar, replies, images, long‑press actions, and user identity handling.",
  "frontend/src/components/docs/DocumentCommentsSection.tsx": "Displays document comments with add and delete functionality, handling permissions and error states.",
  "frontend/src/components/docs/DocumentContentPreview.tsx": "Parses document text for file markers and renders inline images or downloadable file attachments.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Document editor with save, file upload, image insertion, preview mode, and change tracking.",
  "frontend/src/components/docs/ImageUploadWithTitleDialog.tsx": "Dialog for selecting, validating, and uploading an image with an optional title.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Editor UI for viewing, editing, uploading files/images to, and managing visibility of a player document.",
  "frontend/src/components/profile/Avatar.tsx": "Avatar component that displays an image or fallback initials based on user name and size.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "Profile picture management UI allowing upload, validation, progress tracking, and removal.",
  "frontend/src/components/profile/QuickChatProfileDialog.tsx": "Dialog for editing a temporary chat profile including display name and avatar image.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting chat channels with validation and async actions.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Provides dialogs for creating, renaming, deleting, and locking session documents using actor calls with loading and error handling.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Implements export and import controls for session data, including file parsing, confirmation, and error handling.",
  "frontend/src/components/session/MembersChannelManagementDialogs.tsx": "Contains dialogs for creating, renaming, and deleting member channels with mutation hooks and basic validation.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Handles creation and management of player-owned documents, including visibility settings and menu actions for rename and delete.",
  "frontend/src/components/session/PlayerDocumentsDialog.tsx": "Displays a list of player documents, supports creation via a sub-dialog, and allows selecting documents for use.",
  "frontend/src/components/session/SessionDocumentsDialog.tsx": "Dialog component for listing, creating, renaming, selecting, and deleting session documents with related state and API calls.",
  "frontend/src/components/session/SessionSidebar.tsx": "Sidebar UI for navigating channels and settings within a session, supporting collapse, profile access, and channel management dialogs.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Settings view for adjusting user preferences, managing templates, theme, background, and resetting all settings before entering a lobby.",
  "frontend/src/components/settings/UIScaleSettingsPopover.tsx": "Popover for adjusting UI scale via slider or input, with clamping, persistence, and reset functionality.",
  "frontend/src/config/polling.ts": "Defines polling intervals for messages, lists, session info, and document content.",
  "frontend/src/context/PreferencesContext.tsx": "Context provider for loading, storing, updating, and resetting user preferences including theme application.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useDocumentComments.ts": "Hooks for fetching, adding, deleting, and updating document comments with automatic query invalidation.",
  "frontend/src/hooks/useDocumentFiles.ts": "Hooks for listing, retrieving, and uploading document files using the backend actor with validation and cache updates.",
  "frontend/src/hooks/useDocumentImages.ts": "React-query hooks to list and add images to session or player documents, invalidating related queries on mutation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context and hooks for login, logout, and identity lifecycle using AuthClient.",
  "frontend/src/hooks/usePlayerDocuments.ts": "React-query hooks for listing, fetching, creating, editing, renaming, deleting, and updating visibility of player documents.",
  "frontend/src/hooks/usePolling.ts": "Custom hook that runs a callback on a set interval while enabled.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports the usePreferences hook from PreferencesContext.",
  "frontend/src/hooks/useQuickChatProfile.ts": "Manages local quick chat profile loading, saving, and clearing with state and error handling.",
  "frontend/src/hooks/useSessionData.ts": "Fetches session, channels, members' channels, and messages with polling plus mutations for managing member channels.",
  "frontend/src/hooks/useSessionDocuments.ts": "React-query hooks for listing, fetching, creating, editing, renaming, and deleting session documents.",
  "frontend/src/hooks/useUserDisplayName.ts": "Fetches a user’s display name from profile or falls back to a shortened principal string.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to fetch and update caller or arbitrary user profiles, including saving and removing profile pictures.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, dark mode overrides, and layout styles for chat and session views.",
  "frontend/src/lib/clearLocalAppData.ts": "Clears specific localStorage keys and all sessionStorage with error handling.",
  "frontend/src/lib/documentFileMarkers.ts": "Provides utilities to create, parse, insert, and remove file marker tags in text content.",
  "frontend/src/lib/documentImageMarkers.ts": "Provides functions to manage image marker tags, including creation, parsing, insertion, and removal.",
  "frontend/src/lib/preferencesStorage.ts": "Loads, saves, and resets user preferences with validation and clamping for UI scale.",
  "frontend/src/lib/quickChatProfileStorage.ts": "Manages quick chat profile storage with validation for structure, image format, and size.",
  "frontend/src/lib/rollCommand.ts": "Performs basic validation on RPG roll command patterns and returns validity results.",
  "frontend/src/lib/sessionExportFile.ts": "Creates, downloads, and parses session export JSON files with version validation.",
  "frontend/src/lib/sessionStorage.ts": "Stores and retrieves session context data in localStorage, converting sessionId to bigint.",
  "frontend/src/lib/templateHistoryStorage.ts": "Saves, loads, clears, and validates session templates stored in localStorage.",
  "frontend/src/lib/time.ts": "Formats bigint timestamps into human-readable time or date-time strings.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentity provider and renders App.",
  "frontend/src/pages/LobbyPage.tsx": "Implements lobby UI for hosting or joining sessions, handling forms, preferences, templating, and session creation.",
  "frontend/src/pages/SessionPage.tsx": "React page managing session state, switching views between channels and documents, and handling sidebar/dialog interactions.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and plugins for the project's UI theme.",
  "project_state.json": "Metadata describing project state, issues, and feature requests related to UI layout changes in the Session page."
}