{
  "backend/main.mo": "Main Motoko actor defining session, messaging, document, and image types with storage, authorization mixins, and state counters for IDs.",
  "backend/migration.mo": "Migration module converting old user profiles to new ones by adding an optional profilePicture field.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend components and utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining light and dark theme OKLCH color variables and applying global background and text styles.",
  "frontend/index.html": "HTML entrypoint initializing theme mode early from localStorage and mounting the React app.",
  "frontend/src/App.tsx": "Main React app logic handling authentication, profile setup, session restoration, routing, and global preference application.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Chat view component that displays messages, auto-scrolls, and handles sending regular or dice-roll messages via actor calls.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders an individual chat message with avatar, timestamp, and roll highlighting, resolving user profile data for avatars.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Host-facing document editor with locking, revision display, save handling, and error/readonly states.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Player document editor that loads a document, enforces visibility and ownership, and saves edits when allowed.",
  "frontend/src/components/profile/Avatar.tsx": "Displays a user avatar with fallback initials and auto-handling of broken image URLs.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "Manages profile picture upload/removal with validation, progress tracking, and update actions via profile hooks.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting channels using actor calls, with loading and error handling.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Provides dialogs for creating, renaming, deleting, and locking documents, interacting with the backend through the actor API.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Implements session export and import UI for hosts, including file parsing, confirmation dialogs, and error handling.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Contains dialogs and menu actions for players to create, rename, delete, and toggle visibility of their own documents using custom hooks.",
  "frontend/src/components/session/SessionSidebar.tsx": "Renders the session sidebar listing channels and documents with host-only management actions and create dialogs.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Settings screen allowing users to configure preferences such as theme, background, nickname, and load or clear templates.",
  "frontend/src/config/polling.ts": "Defines polling intervals for various periodic data refresh operations.",
  "frontend/src/context/PreferencesContext.tsx": "Provides a React context for user preferences with persistence, theme syncing, and reset functionality.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, logging in, and clearing identities.",
  "frontend/src/hooks/usePlayerDocuments.ts": "Defines React Query hooks for listing, retrieving, creating, editing, renaming, deleting, and updating visibility of player documents via the actor API.",
  "frontend/src/hooks/usePolling.ts": "Implements a simple polling hook that repeatedly invokes a callback at a specified interval when enabled.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports usePreferences from the PreferencesContext for compatibility.",
  "frontend/src/hooks/useSessionData.ts": "Fetches session, channels, documents, messages, and selected document data with polling using React Query and the actor API.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks for fetching and updating user profiles, including caller and arbitrary users, with React Query.",
  "frontend/src/index.css": "Sets global Tailwind styles and CSS variables for light and dark themes, including color palettes and base typography.",
  "frontend/src/lib/documentImageMarkers.ts": "Parses, creates, inserts, and removes image marker tokens within document text content.",
  "frontend/src/lib/preferencesStorage.ts": "Loads, saves, and resets user preferences in localStorage with default fallback values.",
  "frontend/src/lib/rollCommand.ts": "Validates basic dice roll command patterns and returns simple validation results.",
  "frontend/src/lib/sessionExportFile.ts": "Creates, downloads, and parses session export JSON files with version validation.",
  "frontend/src/lib/sessionStorage.ts": "Stores, retrieves, and clears session context data in localStorage.",
  "frontend/src/lib/templateHistoryStorage.ts": "Saves, loads, clears, and validates session template data in localStorage.",
  "frontend/src/lib/time.ts": "Formats bigint timestamps into user-friendly strings, showing only time for today and full date/time otherwise.",
  "frontend/src/main.tsx": "Initializes React root and wraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/LobbyPage.tsx": "Provides host/join session forms, applies templates on host creation, and triggers session joining or logout.",
  "frontend/src/pages/SessionPage.tsx": "Displays the active session with sidebar navigation, channel or document views, and session/member info.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Contains project state metadata, architectural notes, issues, and existing feature definitions for the app."
}