{
  "backend/main.mo": "Defines the main actor with storage mixin, user/session/channel/message/document types, and various request/response variants for the backend.",
  "backend/migration.mo": "Migration module converting old sessions to new format by adding empty membersChannels arrays while preserving other fields.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, descriptions, related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "A JSON-style summary file describing the purpose of multiple frontend components, hooks, utilities, and pages.",
  "frontend/index.css": "Tailwind-based global CSS defining theme variables for light and dark modes, including sidebar and chart colors.",
  "frontend/index.html": "Main HTML entry point setting early theme mode from localStorage and loading the React app root and main script.",
  "frontend/src/App.tsx": "Top-level React app managing identity, user profile setup, session context, routing between Lobby and Session, and logout handling.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "Error boundary component displaying a recovery UI with reload and clear-local-data options when runtime errors occur.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Chat UI component handling text and image messages, roll commands, and auto‑scrolling with upload progress.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders individual chat messages with avatar, timestamps, roll badges, and optional image previews.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Host document editor supporting saving, file uploads with validation, and embedding file markers.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Player-facing document editor allowing content edits, privacy toggling, and file uploads with validation.",
  "frontend/src/components/profile/Avatar.tsx": "Displays a user avatar with fallback initials and optional custom sizing and error handling.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "Manages uploading, previewing, and removing a user’s profile picture with validation and progress.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting session channels with form handling and backend actions.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Provides dialogs for creating, renaming, deleting, and locking session documents using actor API calls with loading and error handling.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Implements session export and import UI with file parsing, confirmation dialogs, and actor-based save/load operations.",
  "frontend/src/components/session/MembersChannelManagementDialogs.tsx": "Contains dialogs to create, rename, and delete members' channels using session data mutations with basic validation and error UI.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Defines dialogs and menus for creating, renaming, deleting, and toggling visibility of player-owned documents via player document hooks.",
  "frontend/src/components/session/PlayerDocumentsDialog.tsx": "Displays a list of player documents, allows selecting or creating documents, and manages visibility and ownership information.",
  "frontend/src/components/session/SessionSidebar.tsx": "Renders a session sidebar listing channels and member channels with create/manage options and selection handling.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Provides a settings page for themes, backgrounds, nicknames, and template import/reset before entering the lobby.",
  "frontend/src/config/polling.ts": "Defines polling intervals for various frontend update loops.",
  "frontend/src/context/PreferencesContext.tsx": "Implements a context for loading, saving, updating, and resetting user preferences including theme handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useDocumentFiles.ts": "Provides hooks to list, fetch, and upload document files using the backend actor with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, logout, and loading stored identities.",
  "frontend/src/hooks/usePlayerDocuments.ts": "Supplies hooks for CRUD operations on player documents with automatic query invalidation and polling.",
  "frontend/src/hooks/usePolling.ts": "A simple polling hook that repeatedly invokes a callback at a specified interval when enabled.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports the usePreferences hook from the preferences context.",
  "frontend/src/hooks/useSessionData.ts": "Provides React Query hooks to fetch and poll session-related data and to mutate member channel records.",
  "frontend/src/hooks/useUserProfile.ts": "Defines hooks to load and update user profiles via an actor interface with React Query.",
  "frontend/src/index.css": "Configures Tailwind CSS and defines light/dark theme variables and base styles.",
  "frontend/src/lib/clearLocalAppData.ts": "Clears specific app-related entries from localStorage and sessionStorage.",
  "frontend/src/lib/documentFileMarkers.ts": "Creates, parses, inserts, and removes file reference markers within document text.",
  "frontend/src/lib/documentImageMarkers.ts": "Handles creation, parsing, insertion, and removal of image markers in document content.",
  "frontend/src/lib/preferencesStorage.ts": "Loads, saves, and resets user UI preferences stored in localStorage.",
  "frontend/src/lib/rollCommand.ts": "Validates basic dice roll command strings and reports simple errors.",
  "frontend/src/lib/sessionExportFile.ts": "Exports session data to a versioned JSON file, supports download and import with validation.",
  "frontend/src/lib/sessionStorage.ts": "Stores, retrieves, and clears session context values in localStorage.",
  "frontend/src/lib/templateHistoryStorage.ts": "Saves, loads, clears, and validates stored session templates in localStorage.",
  "frontend/src/lib/time.ts": "Formats bigint timestamps into readable date or time strings.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and identity provider setup.",
  "frontend/src/pages/LobbyPage.tsx": "Implements the lobby UI for hosting or joining sessions, including template application and identity handling.",
  "frontend/src/pages/SessionPage.tsx": "React page managing session state, channel/document selection, and header UI with dialogs and chat/editor views.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current features, issues, and pending requests for session channels and document changes."
}