{
  "backend/main.mo": "Defines the backend actor and all core data types for sessions, documents, channels, messages, uploads, and images, including storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains human‑written summaries for major frontend files describing their roles and behaviors.",
  "frontend/docs/regression-test-plan-player-document-uploads.md": "Markdown regression test plan covering image and file upload workflows for player and session documents.",
  "frontend/index.css": "Defines global Tailwind CSS layers and OKLCH-based theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point setting early theme mode and mounting the React application.",
  "frontend/src/App.tsx": "Main React app component handling identity, actor initialization, profile setup, session persistence, routing, and failure recovery.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that displays an error screen with reload and clear-data options.",
  "frontend/src/components/app/InitializationFailureScreen.tsx": "Shows initialization errors with retry and clear-data actions, including timeout handling.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Chat view handling message sending, dice roll commands, and image uploads with progress tracking.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders individual chat messages with timestamps, roll indicators, avatars, and optional images.",
  "frontend/src/components/docs/DocumentCommentsSection.tsx": "Displays and manages document comments, including adding and deleting with confirmation dialogs.",
  "frontend/src/components/docs/DocumentContentPreview.tsx": "Parses document content for file markers and renders text, images, or downloadable file attachments.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Document editor supporting content editing, file uploads, image insertion, preview mode, and saving.",
  "frontend/src/components/docs/ImageUploadWithTitleDialog.tsx": "Dialog component for selecting, validating, and uploading an image with an optional title.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Full editor view for player documents with saving, file uploads, image insertion, and preview mode.",
  "frontend/src/components/profile/Avatar.tsx": "Displays a user avatar with fallback initials and error handling for broken images.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "Section for uploading, previewing, and removing a user's profile picture with validation and progress tracking.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting session channels with validation and actor API calls.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Dialogs for creating, renaming, locking, and deleting documents in a session using actor actions.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Provides UI and logic for exporting and importing session data, including file parsing, saving state, confirmation dialogs, and error handling.",
  "frontend/src/components/session/MembersChannelManagementDialogs.tsx": "Implements dialogs for creating, renaming, and deleting member channels with validation, mutation calls, and error display.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Contains dialogs and menus for creating, renaming, deleting, and toggling visibility of player-owned documents using related mutations.",
  "frontend/src/components/session/PlayerDocumentsDialog.tsx": "Displays a list of player documents, allows creation of new ones, and enables selecting a document to open it.",
  "frontend/src/components/session/SessionDocumentsDialog.tsx": "Manages session-wide documents with UI for listing, creating, renaming, deleting, and selecting documents via dialogs and dropdown actions.",
  "frontend/src/components/session/SessionSidebar.tsx": "Renders a sidebar for selecting and managing channels and member channels, with create dialogs and identity-based permissions.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Provides a settings screen for theme, background, nickname, and template management, with file handling and preference updates.",
  "frontend/src/config/polling.ts": "Defines polling intervals for messages, lists, session info, and document content.",
  "frontend/src/context/PreferencesContext.tsx": "Implements a preferences context with load/save/reset logic and applies theme updates to the document.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useActorWithErrorHandling.ts": "Wraps useActor with timeout-based error detection and a refetch mechanism for actor initialization.",
  "frontend/src/hooks/useDocumentComments.ts": "Provides queries and mutations for listing, adding, updating, and deleting document comments using the backend actor.",
  "frontend/src/hooks/useDocumentFiles.ts": "Handles listing, fetching, and uploading document file references with validation and query invalidation.",
  "frontend/src/hooks/useDocumentImages.ts": "Manages listing and adding images to documents or player documents, with backend calls and query refreshes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks to manage Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/usePlayerDocuments.ts": "React-query hooks for listing, fetching, creating, editing, renaming, deleting, and updating visibility of player documents via the actor API.",
  "frontend/src/hooks/usePolling.ts": "A simple polling hook that repeatedly runs a callback at a given interval when enabled.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports the usePreferences hook from the PreferencesContext for backward compatibility.",
  "frontend/src/hooks/useSessionData.ts": "Fetches session, channels, members channels, and messages with polling, and provides mutations for managing members' channels.",
  "frontend/src/hooks/useSessionDocuments.ts": "React-query hooks for CRUD operations on session documents using the actor API with automatic query invalidation.",
  "frontend/src/hooks/useUserDisplayName.ts": "Fetches and returns a user's display name, falling back to a shortened principal if unavailable.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for retrieving, saving, and modifying user profiles, including profile picture removal, with proper query invalidation.",
  "frontend/src/index.css": "Tailwind CSS base styles and custom CSS variables defining light and dark themes with a green-accent color palette.",
  "frontend/src/lib/clearLocalAppData.ts": "Clears specific app-related localStorage keys and all sessionStorage, handling errors safely.",
  "frontend/src/lib/documentFileMarkers.ts": "Utility functions for creating, parsing, inserting, and removing file marker tags embedded in document text.",
  "frontend/src/lib/documentImageMarkers.ts": "Parses, creates, inserts, and removes custom [IMAGE:id:caption] markers in text.",
  "frontend/src/lib/preferencesStorage.ts": "Loads, saves, and resets user UI preferences in localStorage.",
  "frontend/src/lib/rollCommand.ts": "Parses dice roll strings, performs random rolls, and formats roll results.",
  "frontend/src/lib/sessionExportFile.ts": "Creates, downloads, and imports session export JSON files with version checks.",
  "frontend/src/lib/sessionStorage.ts": "Stores, retrieves, and clears session context data in localStorage.",
  "frontend/src/lib/templateHistoryStorage.ts": "Manages saving, loading, clearing, and validating session templates in localStorage.",
  "frontend/src/lib/time.ts": "Formats bigint timestamps into readable time or date-time strings.",
  "frontend/src/main.tsx": "Bootstraps React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/LobbyPage.tsx": "Handles session hosting/joining UI, validation, and template application before entering a session.",
  "frontend/src/pages/SessionPage.tsx": "Manages main session UI including channels, documents, and view switching.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, persist, and clear URL parameters and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, container settings, and adding typography, container-queries, and animate plugins.",
  "project_state.json": "JSON describing project metadata, known initialization hang issue, and a list of existing feature requests for fixes."
}