{
  "backend/main.mo": "Defines the actor and all core data types for sessions, documents, messages, images, files, and storage integration using mixins.",
  "feature_evidence.json": "Feature evidence report describing enhanced preview markup support and listing affected frontend files and components.",
  "frontend-file-summaries.txt": "Collection of autogenerated one‑sentence summaries for numerous frontend source files.",
  "frontend/docs/regression-test-plan-player-document-uploads.md": "Regression test plan covering player document uploads, privacy behavior, error handling, and preview markup checks.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables, light/dark themes, and base element styling.",
  "frontend/index.html": "Base HTML file that initializes theme mode early and loads the React application root.",
  "frontend/src/App.tsx": "Main React application logic handling authentication, profile setup, session restoration, routing, UI scaling, and logout behavior.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that displays a fallback UI with error details and options to reload or clear local data.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Chat view handling message input, roll commands, image uploads, auto-scroll, and posting messages to a channel.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders an individual chat message with avatar, reply preview, long‑press handling, and user profile resolution.",
  "frontend/src/components/docs/DocumentCommentsSection.tsx": "Displays document comments with add/delete functionality, error handling, and confirmation dialogs.",
  "frontend/src/components/docs/DocumentContentPreview.tsx": "Renders document content with inline support for images, attachments, and file lookup using tokenized markup.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Full document editor with saving, file uploads, image insertion, preview mode, and unsaved‑change tracking.",
  "frontend/src/components/docs/ImageUploadWithTitleDialog.tsx": "Dialog for selecting, validating, and uploading an image with an optional title. Handles file type/size checks, errors, and upload state.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Editor view for player documents with content editing, saving, visibility control, file uploads, and image insertion. Manages document state, errors, and preview mode.",
  "frontend/src/components/profile/Avatar.tsx": "Displays a user avatar using an image or fallback initials. Handles load errors and supports multiple size options.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "Profile picture management UI allowing upload, validation, progress tracking, and removal. Integrates with user profile hooks and shows current avatar.",
  "frontend/src/components/profile/QuickChatProfileDialog.tsx": "Dialog for setting a temporary display name and avatar for quick chat. Supports image upload, validation, previews, and clearing the profile.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting chat channels. Handles form input, validation, API calls, and success callbacks.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Provides dialogs for creating, renaming, deleting, and locking documents using actor calls with controlled and internal dialog states.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Implements session export and import UI with file handling, confirmation dialogs, and integration with backend export/import APIs.",
  "frontend/src/components/session/MembersChannelManagementDialogs.tsx": "Displays dialogs to create, rename, and delete members' channels using mutation hooks and simple form validation.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Manages creation, renaming, deletion, and visibility settings for player-owned documents through dialogs and dropdown menus.",
  "frontend/src/components/session/PlayerDocumentsDialog.tsx": "Shows a list of a player's documents with create functionality and selection handling, including private document indicators.",
  "frontend/src/components/session/SessionDocumentsDialog.tsx": "Dialog component for listing, creating, renaming, deleting, and selecting session documents.",
  "frontend/src/components/session/SessionSidebar.tsx": "Sidebar for navigating channels, managing quick profile, UI scale, and collapsing/expanding layout.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Settings page allowing theme, background, nickname, and template management before entering a lobby.",
  "frontend/src/components/settings/UIScaleSettingsPopover.tsx": "Popover control for adjusting and resetting UI scale preferences.",
  "frontend/src/config/polling.ts": "Defines polling interval constants for various frontend data refresh cycles.",
  "frontend/src/context/PreferencesContext.tsx": "Context provider for loading, updating, and resetting user preferences with theme application logic.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor based on identity and refreshes dependent queries.",
  "frontend/src/hooks/useDocumentComments.ts": "Hooks for fetching, adding, updating, and deleting comments tied to document IDs using react-query.",
  "frontend/src/hooks/useDocumentFiles.ts": "Hooks for listing files, retrieving file references, and uploading files associated with documents.",
  "frontend/src/hooks/useDocumentImages.ts": "Provides React Query hooks for listing document images and adding images to session or player documents, with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling identity loading, login, logout, and status management.",
  "frontend/src/hooks/usePlayerDocuments.ts": "Offers hooks for listing, fetching, creating, editing, renaming, deleting, and managing visibility of player documents via the actor API.",
  "frontend/src/hooks/usePolling.ts": "Defines a simple polling hook that repeatedly invokes a callback on a set interval when enabled.",
  "frontend/src/hooks/usePreferences.ts": "Re‑exports the usePreferences hook from the PreferencesContext.",
  "frontend/src/hooks/useQuickChatProfile.ts": "Manages loading, saving, and clearing a locally stored quick chat profile with error handling.",
  "frontend/src/hooks/useSessionData.ts": "Fetches session, channels, members’ channels, and messages with polling, plus provides mutations for managing members’ channels.",
  "frontend/src/hooks/useSessionDocuments.ts": "Exposes hooks for listing, retrieving, creating, renaming, editing, and deleting session documents with query invalidation.",
  "frontend/src/hooks/useUserDisplayName.ts": "Retrieves a user's display name from their profile or falls back to a shortened principal string.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks for fetching and updating caller and other user profiles, including profile picture removal.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, dark mode overrides, and layout/scroll styles for chat and session views.",
  "frontend/src/lib/clearLocalAppData.ts": "Clears specific localStorage keys and sessionStorage with error handling.",
  "frontend/src/lib/documentFileMarkers.ts": "Creates, parses, inserts, and removes custom [FILE:id:name] markers within text content.",
  "frontend/src/lib/documentImageMarkers.ts": "Handles creation, parsing, insertion, and removal of [IMAGE:id:caption] markers.",
  "frontend/src/lib/documentPreviewMarkup.tsx": "Tokenizes content, parses line prefixes, and renders inline markup such as spoilers and underlines in React.",
  "frontend/src/lib/preferencesStorage.ts": "Loads, saves, clamps, and resets user UI/theme preferences in localStorage.",
  "frontend/src/lib/quickChatProfileStorage.ts": "Manages quick chat profile storage with validation for structure, data URL, and size.",
  "frontend/src/lib/rollCommand.ts": "Performs basic validation of dice roll command patterns like '2d6+3'.",
  "frontend/src/lib/sessionExportFile.ts": "Creates, downloads, and imports JSON session export files with version checks.",
  "frontend/src/lib/sessionStorage.ts": "Stores, loads, and clears session context data in localStorage.",
  "frontend/src/lib/templateHistoryStorage.ts": "Saves, loads, clears, and validates session template data in localStorage.",
  "frontend/src/lib/time.ts": "Formats bigint timestamps into readable time or date strings.",
  "frontend/src/main.tsx": "Initializes React app root with QueryClient and InternetIdentity providers and loads global CSS.",
  "frontend/src/pages/LobbyPage.tsx": "Provides UI and logic to host or join sessions, manage form state, apply templates, and trigger session join events.",
  "frontend/src/pages/SessionPage.tsx": "Handles in-session views including channels, player documents, and session documents, managing selection state and data fetching.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, animations, container settings, and plugins like typography and container queries.",
  "project_state.json": "Describes project metadata and feature requests related to adding lightweight markup rendering tools for document previews."
}