{
  "backend/main.mo": "Defines the backend actor with storage mixins and extensive type definitions for sessions, documents, messages, images, files, and related request/response structures.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requirements to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of many frontend files describing their purposes, behaviors, and responsibilities across the app.",
  "frontend/docs/regression-test-plan-player-document-uploads.md": "Regression test plan outlining detailed steps and expected results for player document image/file uploads and related error handling.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark theme CSS variables and applying shared base styles.",
  "frontend/index.html": "Basic HTML entry point initializing theme from localStorage and loading the React application.",
  "frontend/src/App.tsx": "Main application component handling identity login, profile setup, session restoration, routing, and global preference-based UI scaling.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a recovery UI with reload and clear-data options.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Channel chat interface handling message sending, roll commands, image uploads, and auto-scrolling.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders a single chat message with avatar, reply preview, long-press detection, and user profile resolution.",
  "frontend/src/components/docs/DocumentCommentsSection.tsx": "Displays document comments with add/delete functionality, error handling, and identity-based permissions.",
  "frontend/src/components/docs/DocumentContentPreview.tsx": "Parses document text to render inline file markers, showing images or downloadable file attachments.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Full document editor supporting content editing, file uploads, image insertion, autosave state, and preview mode.",
  "frontend/src/components/docs/ImageUploadWithTitleDialog.tsx": "Provides a dialog for selecting, validating, and uploading an image with an optional title, handling errors and upload state.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Implements a full editor for player documents with saving, visibility controls, file uploads, image insertion, and preview mode.",
  "frontend/src/components/profile/Avatar.tsx": "Renders a user avatar that shows an image or fallback initials with configurable sizes and error handling.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "Manages uploading, displaying, and removing the user's profile picture with validation and progress tracking.",
  "frontend/src/components/profile/QuickChatProfileDialog.tsx": "Dialog for setting a temporary display name and avatar for quick chat sessions, supporting image upload and local storage.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Handles creating, renaming, and deleting session channels through dialogs with validation and backend calls.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "UI dialogs for creating, renaming, deleting, and locking session-level documents using actor calls.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Provides session export and import controls with file handling, confirmation, and error states.",
  "frontend/src/components/session/MembersChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting member channels via session data mutations.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Manages creation, renaming, deletion, and visibility of player-owned documents through dedicated hooks.",
  "frontend/src/components/session/PlayerDocumentsDialog.tsx": "Displays a list of player documents, allows selection, and opens a dialog to create new ones.",
  "frontend/src/components/session/SessionDocumentsDialog.tsx": "Dialog UI for listing, creating, renaming, deleting, and selecting session documents using related hooks. Manages modal states, validation, and calls onSelectDocument after creation.",
  "frontend/src/components/session/SessionSidebar.tsx": "Sidebar for navigating channels and member channels with collapse control, profile access, and UI scale settings. Includes dialogs for channel management and quick profile editing.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Settings page for theme, background image, nickname, and session template management. Handles template import/clear, preference updates, and full settings reset.",
  "frontend/src/components/settings/UIScaleSettingsPopover.tsx": "Popover for adjusting UI scale via slider or numeric input. Updates preferences and provides a reset-to-default option.",
  "frontend/src/config/polling.ts": "Defines polling intervals in milliseconds for messages, lists, session info, and document content.",
  "frontend/src/context/PreferencesContext.tsx": "Context provider for loading, updating, saving, and resetting user preferences. Applies theme changes to the document and exposes a hook for access.",
  "frontend/src/hooks/useActor.ts": "React Query hook creating a backend actor based on authentication and refreshing dependent queries on change. Initializes access control when authenticated.",
  "frontend/src/hooks/useDocumentComments.ts": "Hooks for fetching, adding, deleting, and updating document comments via the backend actor. Automatically refreshes queries on mutations.",
  "frontend/src/hooks/useDocumentFiles.ts": "Hooks for listing, retrieving, and uploading document file references using the backend actor. Validates document ID and invalidates queries after uploads.",
  "frontend/src/hooks/useDocumentImages.ts": "Provides hooks to list document images and add images to session or player documents, invalidating related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, identity loading, and state management via AuthClient.",
  "frontend/src/hooks/usePlayerDocuments.ts": "Defines hooks to query and mutate player-owned documents, including listing, fetching, creating, editing, renaming, deleting, and visibility changes.",
  "frontend/src/hooks/usePolling.ts": "Implements a polling hook that repeatedly runs a callback at a set interval when enabled.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports the usePreferences hook from the preferences context.",
  "frontend/src/hooks/useQuickChatProfile.ts": "Manages loading, saving, and clearing a locally stored quick chat profile with internal state.",
  "frontend/src/hooks/useSessionData.ts": "Fetches and polls session data including session details, channels, member channels, and messages, plus mutations for member channels.",
  "frontend/src/hooks/useSessionDocuments.ts": "Provides hooks for listing, fetching, creating, editing, renaming, and deleting session documents with cache invalidation.",
  "frontend/src/hooks/useUserDisplayName.ts": "Fetches a user’s display name with fallback to truncated principal formatting.",
  "frontend/src/hooks/useUserProfile.ts": "Handles fetching and updating user profiles for the caller or other principals, including profile picture removal.",
  "frontend/src/index.css": "Defines global Tailwind layers, color variables for light/dark themes, chat utilities, and layout/scrolling rules.",
  "frontend/src/lib/clearLocalAppData.ts": "Clears specific app localStorage keys and all sessionStorage with error handling.",
  "frontend/src/lib/documentFileMarkers.ts": "Creates, parses, inserts, and removes file marker tags within text content.",
  "frontend/src/lib/documentImageMarkers.ts": "Creates, parses, inserts, and removes image marker tags within text content.",
  "frontend/src/lib/preferencesStorage.ts": "Loads, saves, and resets user UI preferences with validation and clamping for scale values.",
  "frontend/src/lib/quickChatProfileStorage.ts": "Handles loading, saving, validating, and clearing a quick chat profile stored in localStorage.",
  "frontend/src/lib/rollCommand.ts": "Performs basic validation on dice roll command patterns and returns validity results.",
  "frontend/src/lib/sessionExportFile.ts": "Creates, downloads, and validates JSON export/import files for session data.",
  "frontend/src/lib/sessionStorage.ts": "Stores, retrieves, and clears minimal session context data in localStorage.",
  "frontend/src/lib/templateHistoryStorage.ts": "Manages saving, loading, clearing, and validating reusable session templates in localStorage.",
  "frontend/src/lib/time.ts": "Formats bigint timestamps into human-readable time or date/time strings.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/LobbyPage.tsx": "Implements the lobby UI for hosting or joining sessions, including template application and form handling.",
  "frontend/src/pages/SessionPage.tsx": "Renders the main session interface with channels, documents, messaging, and view selection logic.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query or hash, persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Defines Tailwind theme extensions, colors, animations, and plugin setup for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, existing feature requirements, and pending requests for a quick chat profile feature using local device storage."
}