{
  "backend/main.mo": "Main backend actor defining all core types for sessions, channels, messages, documents, images, files, and storage mixins.",
  "backend/migration.mo": "Migration module containing old type definitions and data structures used for upgrading persisted canister state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "List of short summaries for major frontend source files describing their purpose and behavior.",
  "frontend/docs/regression-test-plan-player-document-uploads.md": "Regression test plan detailing player document upload scenarios, expected results, and error handling checks.",
  "frontend/index.css": "Global Tailwind-based style definitions including light/dark theme variables and shared utility layers.",
  "frontend/index.html": "HTML entry point initializing theme mode early and loading the React application root.",
  "frontend/src/App.tsx": "Main app component handling identity login, profile setup, session restoration and routing between lobby and session pages.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "Error boundary that displays a recovery UI and allows reloading or clearing local data when an error occurs.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Chat interface for a session channel supporting text, dice roll commands, file uploads, and reply targeting.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders a chat message with avatar, reply preview, long-press handling, and optional image display.",
  "frontend/src/components/docs/DocumentCommentsSection.tsx": "Loads, displays, adds, and deletes comments on a document, with host permissions and error handling.",
  "frontend/src/components/docs/DocumentContentPreview.tsx": "Parses embedded file markers and renders document text with inline image previews and file attachments.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Editor for host documents with saving, file uploads, image insertion, preview mode, and comment integration.",
  "frontend/src/components/docs/ImageUploadWithTitleDialog.tsx": "Dialog for selecting, validating, titling, and uploading an image file.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Editor for player-owned documents with saving, visibility controls, file uploads, and preview features.",
  "frontend/src/components/profile/Avatar.tsx": "Avatar component that displays a user's profile image or initials with size variants.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "UI section for uploading, previewing, and removing a user's profile picture with progress tracking.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Dialogs to create, rename, and delete session channels using actor API calls.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Provides dialogs for creating, renaming, deleting, and locking documents using actor API calls with state management and UI feedback.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Implements session export and import controls with file parsing, confirmation dialog, and error handling for host users.",
  "frontend/src/components/session/MembersChannelManagementDialogs.tsx": "Contains dialogs for creating, renaming, and deleting member channels using session data mutations and simple validation.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Defines dialogs and menus for creating, renaming, deleting, and managing privacy of player-owned documents through related mutations.",
  "frontend/src/components/session/PlayerDocumentsDialog.tsx": "Displays a dialog listing player documents with create option, ownership indicators, and selection handling.",
  "frontend/src/components/session/SessionDocumentsDialog.tsx": "Dialog component for listing, creating, renaming, deleting, and selecting session documents.",
  "frontend/src/components/session/SessionSidebar.tsx": "Sidebar showing channels and members’ channels with controls for creation and selection.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Settings page for theme, background, nickname, and template management before entering a lobby.",
  "frontend/src/config/polling.ts": "Defines polling intervals for messages, lists, session info, and document content.",
  "frontend/src/context/PreferencesContext.tsx": "Context provider managing user preferences with update and reset utilities.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor, updating queries when identity changes.",
  "frontend/src/hooks/useDocumentComments.ts": "Hooks for fetching, adding, updating, and deleting comments on documents.",
  "frontend/src/hooks/useDocumentFiles.ts": "Hooks for listing, retrieving, and uploading document file references.",
  "frontend/src/hooks/useDocumentImages.ts": "Hooks for listing and adding images to documents or player documents.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, handling login, logout, and identity loading via AuthClient.",
  "frontend/src/hooks/usePlayerDocuments.ts": "Defines React Query hooks for listing, fetching, creating, editing, renaming, deleting, and changing visibility of player documents through the actor API.",
  "frontend/src/hooks/usePolling.ts": "Implements a simple polling hook that repeatedly invokes a callback at a specified interval when enabled.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports the usePreferences hook from the PreferencesContext for compatibility.",
  "frontend/src/hooks/useSessionData.ts": "Provides session-related data via React Query, including sessions, channels, members' channels, and messages, plus mutations for managing channels.",
  "frontend/src/hooks/useSessionDocuments.ts": "Defines React Query hooks for listing, fetching, creating, editing, renaming, and deleting session-level documents.",
  "frontend/src/hooks/useUserDisplayName.ts": "Fetches a user's display name, falling back to a shortened principal if no profile name exists.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to get and update user profiles, including the caller’s profile and profile picture management.",
  "frontend/src/index.css": "Tailwind CSS config defining theme variables, dark mode overrides, and UI utility classes for layout and styling.",
  "frontend/src/lib/clearLocalAppData.ts": "Clears specific localStorage keys and all sessionStorage, with error handling.",
  "frontend/src/lib/documentFileMarkers.ts": "Provides utilities for creating, parsing, inserting, and removing custom file marker tags within document content.",
  "frontend/src/lib/documentImageMarkers.ts": "Parses, creates, inserts, and removes custom [IMAGE:id:caption] markers in text content.",
  "frontend/src/lib/preferencesStorage.ts": "Loads, saves, and resets user UI preferences via localStorage with default values.",
  "frontend/src/lib/rollCommand.ts": "Performs basic validation of dice roll command patterns and returns validation status.",
  "frontend/src/lib/sessionExportFile.ts": "Creates, downloads, and parses versioned session export JSON files with validation.",
  "frontend/src/lib/sessionStorage.ts": "Stores, retrieves, and clears lightweight session context data in localStorage.",
  "frontend/src/lib/templateHistoryStorage.ts": "Saves, loads, clears, and validates session template data in localStorage.",
  "frontend/src/lib/time.ts": "Formats bigint timestamps into human-readable time or date-time strings.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/LobbyPage.tsx": "Implements lobby UI for hosting or joining sessions, handling templates and form logic.",
  "frontend/src/pages/SessionPage.tsx": "Manages live session UI including channels, documents, and view switching based on selections.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color variables, container settings, extended animations, shadows, radii, and loads typography, container-queries, and animate plugins.",
  "project_state.json": "Defines project state including chat UI requirements, reply-to-message plans, backend persistence notes, and known issues for message reply implementation."
}