{
  "backend/main.mo": "Defines the actor with storage mixin and all core types for sessions, documents, channels, messages, images, and uploads.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend source files for reference or documentation.",
  "frontend/docs/regression-test-plan-player-document-uploads.md": "Regression test plan detailing steps and expected results for player document file and image upload behavior.",
  "frontend/index.css": "Global Tailwind-based styles defining color variables, dark mode overrides, and base UI styling.",
  "frontend/index.html": "HTML entry point setting theme early from localStorage and loading the React app root.",
  "frontend/src/App.tsx": "Main React application logic handling authentication, profile setup, session restoration, routing, and global providers.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and shows a recovery UI with reload and clear-data options.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Chat interface for sending text, roll commands, and images with auto-scroll, replies, and upload progress.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders individual chat messages with avatar, replies, long‑press detection, and optional image or roll formatting.",
  "frontend/src/components/docs/DocumentCommentsSection.tsx": "Displays document comments with add and delete actions, including confirmation dialogs and error handling.",
  "frontend/src/components/docs/DocumentContentPreview.tsx": "Parses and renders document text with embedded file markers, showing inline images or downloadable file attachments.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Full document editor supporting text editing, file uploads, image insertion, preview mode, and save with revision tracking.",
  "frontend/src/components/docs/ImageUploadWithTitleDialog.tsx": "Dialog for selecting, validating, titling, and uploading an image file with size/type checks.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Full editor for player documents supporting editing, saving, visibility toggling, file uploads, and image insertion.",
  "frontend/src/components/profile/Avatar.tsx": "Displays a user avatar showing an image or fallback initials with size options.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "Manages viewing, uploading, and removing the user's profile picture with validation and progress tracking.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting session channels with validation and async actions.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Dialogs for creating, renaming, deleting, and locking documents within a session.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Component providing export and import actions for a session, including file parsing, confirmation dialogs, and error handling.",
  "frontend/src/components/session/MembersChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting members’ channels with form handling and mutation calls.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Dialogs and menus for creating, renaming, deleting, and toggling visibility of player-owned documents.",
  "frontend/src/components/session/PlayerDocumentsDialog.tsx": "Dialog listing player documents, allowing creation of new ones and selection of existing documents.",
  "frontend/src/components/session/SessionDocumentsDialog.tsx": "Dialog for listing, creating, renaming, selecting, and deleting session-wide documents with error handling.",
  "frontend/src/components/session/SessionSidebar.tsx": "Sidebar component managing channels, member channels, collapse state, and creation dialogs with UI controls.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Settings view for theme, background, nickname, template import/export, and resetting preferences before entering a lobby.",
  "frontend/src/components/settings/UiScaleControl.tsx": "Popover control allowing users to adjust UI scale via slider or presets and update preferences.",
  "frontend/src/config/polling.ts": "Defines polling intervals for messages, lists, sessions, and document content.",
  "frontend/src/context/PreferencesContext.tsx": "React context for loading, updating, persisting, and resetting user preferences including theme and UI scale.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor tied to identity, with query invalidation on change.",
  "frontend/src/hooks/useDocumentComments.ts": "Hooks for fetching, adding, deleting, and updating document comments with automatic query invalidation.",
  "frontend/src/hooks/useDocumentFiles.ts": "Hooks for listing, fetching, and uploading document file references with validation and cache refresh.",
  "frontend/src/hooks/useDocumentImages.ts": "Hooks to list images and add images to documents or player documents, triggering related query updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth, creating AuthClient instances, and exposing login state and actions.",
  "frontend/src/hooks/usePlayerDocuments.ts": "React Query hooks for listing, retrieving, creating, editing, renaming, deleting, and updating visibility of player documents via the actor API.",
  "frontend/src/hooks/usePolling.ts": "Simple polling hook that repeatedly invokes a callback at a given interval when enabled.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports usePreferences from the PreferencesContext for compatibility.",
  "frontend/src/hooks/useSessionData.ts": "Aggregates session-related queries for sessions, channels, member channels, and messages, plus mutations for managing member channels.",
  "frontend/src/hooks/useSessionDocuments.ts": "React Query hooks for CRUD operations on session-level documents through the actor API.",
  "frontend/src/hooks/useUserDisplayName.ts": "Fetches a user's display name with fallback to a shortened principal using React Query.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching and mutating user profile data, including profile picture removal and saving caller profile.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, dark mode, UI scaling, and chat-specific utilities.",
  "frontend/src/lib/clearLocalAppData.ts": "Utility for clearing app-related localStorage keys and sessionStorage.",
  "frontend/src/lib/documentFileMarkers.ts": "Utilities for creating, parsing, inserting, and removing file marker tags in document content.",
  "frontend/src/lib/documentImageMarkers.ts": "Utilities for handling image marker tags in document content, including creation, parsing, insertion, and removal.",
  "frontend/src/lib/preferencesStorage.ts": "Manages user preferences in localStorage with load, save, and reset functions using default values as fallback.",
  "frontend/src/lib/rollCommand.ts": "Validates basic dice roll command patterns and returns simple validation results.",
  "frontend/src/lib/sessionExportFile.ts": "Creates, downloads, and parses session export files with version checks and data validation.",
  "frontend/src/lib/sessionStorage.ts": "Stores and retrieves session context data in localStorage with helpers to clear stored sessions.",
  "frontend/src/lib/templateHistoryStorage.ts": "Saves, loads, clears, and validates session templates in localStorage.",
  "frontend/src/lib/time.ts": "Formats bigint timestamps into human-readable times, showing only time for today or date/time otherwise.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/LobbyPage.tsx": "Provides UI and logic for hosting or joining sessions, including template application and identity use.",
  "frontend/src/pages/SessionPage.tsx": "Manages session interaction views including channels and documents, handling selection and data fetching.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and persisting URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins for the project.",
  "project_state.json": "Defines the project’s current state, listing implemented UI-scaling features, a pending feature request, and general metadata. Describes settings for UI scale control, persistence, and application across the app."
}