{
  "backend/main.mo": "Main Motoko actor defining all data types (Session, Document, PlayerDocument, Message, Channel, etc.), storage mixins, and backend API for a collaborative RPG session platform with chat, documents, file uploads, and access control.",
  "feature_evidence.json": "Feature evidence report documenting four mobile responsiveness features: full-width chat on mobile, dynamic resize handling, scrollable modal dialogs, and touch-friendly UI sizing with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files covering components, hooks, utilities, pages, and configuration for the RPG session management application with mobile-responsive UI.",
  "frontend/docs/regression-test-plan-player-document-uploads.md": "Detailed regression test plan for player document uploads covering creation, privacy toggles, file/image uploads, disabled states, error handling, visibility controls, and preview markup rendering.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light/dark theme variables for UI components, sidebar, charts, and semantic color tokens.",
  "frontend/index.html": "HTML entry point with viewport meta tag, early dark mode initialization script to prevent flash, and root div for React mounting.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, profile setup, session context restoration from localStorage, routing between Lobby and Session pages, startup failure detection, and global UI scaling via CSS transform based on user preferences.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary component that catches application errors and displays a recovery UI with options to reload the page or clear local data and reload.",
  "frontend/src/components/app/StartupFailureScreen.tsx": "Full-screen error component displayed when the application fails to initialize, offering reload and clear-data-and-reload recovery options.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Main chat interface component for a channel that displays messages, handles message sending (including dice roll commands), image uploads with progress tracking, reply functionality, and auto-scroll behavior.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Individual chat message component that renders message content, author avatar, timestamps, reply threads, images, and handles long-press interactions for message actions.",
  "frontend/src/components/communities/CommunityForm.tsx": "Form component for creating or editing communities with fields for name, description, images, privacy settings, join type, join questions, sub-places, and theme customization.",
  "frontend/src/components/communities/CommunityThemePreview.tsx": "Live preview component that displays how a community will look with the selected theme colors, fonts, and images.",
  "frontend/src/components/communities/CreateCommunityDialog.tsx": "Modal dialog that wraps the community form and theme preview, handles form submission validation, and manages the community creation flow.",
  "frontend/src/components/communities/fields/AdvancedCustomizationSection.tsx": "A collapsible section for advanced community theme customization, including color pickers for primary/accent/text/background colors, background preset selection, font family selection, and contrast warnings.",
  "frontend/src/components/communities/fields/CommunityImagePickers.tsx": "Provides file upload UI for three community images (cover, icon, banner) with preview, validation, upload progress tracking, and removal functionality using the useCommunityImageUpload hook.",
  "frontend/src/components/communities/fields/JoinQuestionsEditor.tsx": "Allows adding, editing, and removing up to 3 optional custom questions that users must answer when requesting to join a community.",
  "frontend/src/components/communities/fields/SubPlacesEditor.tsx": "Manages creation and editing of 1-5 sub-places (sections) for a community, each with a name and type (Chat, Documents, or RPG).",
  "frontend/src/components/docs/DocumentCommentsSection.tsx": "Displays and manages comments on a document, allowing authenticated users to add comments and hosts/authors to delete them, with real-time updates via React Query hooks.",
  "frontend/src/components/docs/DocumentContentPreview.tsx": "Renders document content by tokenizing text and file markers, displaying inline images and downloadable file attachments with markup rendering support.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Document editor component for session hosts to edit shared documents, supporting markdown content editing, file/image uploads with progress tracking, file markers for attachments, and preview/edit mode toggling with comments section.",
  "frontend/src/components/docs/ImageUploadWithTitleDialog.tsx": "Dialog component for uploading images with optional titles, validating file type (jpg/png/gif/webp) and size (max 10MB), with auto-filled title from filename and error handling.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Player-specific document editor with visibility toggle controls, supporting personal document editing, file/image uploads, and preview mode similar to DocumentEditorView but for player-owned documents.",
  "frontend/src/components/profile/Avatar.tsx": "Reusable avatar component displaying user profile images with fallback to initials, supporting three sizes (sm/md/lg) and error handling for failed image loads.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "Profile picture upload section with preview, validation (PNG/JPG, max 5MB), upload progress display, and remove functionality using the Avatar component.",
  "frontend/src/components/profile/QuickChatProfileDialog.tsx": "Dialog for setting temporary local chat profile with display name and avatar stored as data URL, including image validation (5MB max), clear functionality, and local storage persistence.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Provides dialogs and dropdown menu items for creating, renaming, and deleting channels in a session. Uses actor hooks to call backend methods and handles loading/error states.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Provides dialogs and dropdown menu items for creating, renaming, deleting, and locking/unlocking documents in a session. Uses actor hooks to call backend methods with loading/error handling.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Provides a dropdown menu for session hosts to export session data to a JSON file or import session data from a file. Includes confirmation dialog for imports and error handling.",
  "frontend/src/components/session/MembersChannelManagementDialogs.tsx": "Provides dialogs and dropdown menu items for creating, renaming, and deleting members' channels using React Query mutations. Handles validation and error states for channel operations.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Provides a creation dialog and management menu for player-owned documents with privacy controls. Uses React Query mutations for create, rename, delete, and visibility toggle operations.",
  "frontend/src/components/session/PlayerDocumentsDialog.tsx": "Dialog component for viewing and managing player documents within a session, allowing users to create new documents, view existing ones, and select documents with ownership and privacy indicators.",
  "frontend/src/components/session/SessionDocumentsDialog.tsx": "Dialog component for managing session-wide documents with create, rename, and delete operations, displaying document lists with metadata and handling document selection.",
  "frontend/src/components/session/SessionSidebar.tsx": "Collapsible sidebar component for session navigation that displays channels, members channels, and provides access to quick profile settings and UI scale controls.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Settings view for pre-lobby configuration including theme toggle, background image upload, nickname settings, profile picture management, and session template import/export functionality.",
  "frontend/src/components/settings/UIScaleSettingsPopover.tsx": "Popover component that provides a slider and input field to adjust UI scale from 10% to 200% with reset functionality.",
  "frontend/src/config/polling.ts": "Configuration file defining polling intervals in milliseconds for various data types including messages, lists, session info, and document content.",
  "frontend/src/context/PreferencesContext.tsx": "React context provider for managing user preferences including theme mode, with persistence to local storage and automatic theme application to the document.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, handling both authenticated and anonymous actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useActorStartupGuard.ts": "Monitors actor initialization state and detects failures or timeouts (15s) when authenticated, returning startup failure status and reason.",
  "frontend/src/hooks/useCommunityImageUpload.ts": "Handles community image uploads using ExternalBlob, tracking upload progress, errors, and providing reset functionality.",
  "frontend/src/hooks/useDocumentComments.ts": "Provides React Query hooks for fetching, adding, updating, and deleting document comments with automatic cache invalidation.",
  "frontend/src/hooks/useDocumentFiles.ts": "Manages document file operations including listing files, fetching file references, and uploading files with validation and cache invalidation.",
  "frontend/src/hooks/useDocumentImages.ts": "Provides hooks for listing document images and adding images to both session documents and player documents with position and size parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login, logout, identity management, and configurable AuthClient options.",
  "frontend/src/hooks/usePlayerDocuments.ts": "Manages player document CRUD operations including create, read, update, delete, rename, and visibility settings with automatic query invalidation.",
  "frontend/src/hooks/usePolling.ts": "Custom hook that sets up an interval-based polling mechanism with enable/disable control and callback reference management.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports usePreferences from PreferencesContext for backwards compatibility.",
  "frontend/src/hooks/useQuickChatProfile.ts": "Manages quick chat profile state with localStorage persistence, providing load, save, and clear operations.",
  "frontend/src/hooks/useSessionData.ts": "Aggregates session-related queries (session, channels, members channels, messages) with configurable polling intervals and provides mutations for members channel operations.",
  "frontend/src/hooks/useSessionDocuments.ts": "React Query hooks for managing session documents: listing, getting, creating, renaming, deleting, and editing documents with automatic cache invalidation.",
  "frontend/src/hooks/useUserDisplayName.ts": "React Query hook that fetches and displays user names from profiles, falling back to shortened principal IDs if unavailable.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and updating user profiles, including caller profile, specific user profiles, saving profiles, and removing profile pictures.",
  "frontend/src/hooks/useViewportHeight.ts": "Custom React hook that tracks dynamic viewport height changes for handling mobile keyboards, screen rotation, and other viewport adjustments.",
  "frontend/src/index.css": "Tailwind CSS configuration with OKLCH color system for light/dark themes, custom CSS classes for chat bubbles, session layouts, and mobile-responsive viewport handling.",
  "frontend/src/lib/clearLocalAppData.ts": "Utility function to clear specific app-related keys from localStorage and sessionStorage for data cleanup.",
  "frontend/src/lib/colorContrast.ts": "Functions to calculate color contrast ratios using relative luminance and validate WCAG AA compliance for text readability.",
  "frontend/src/lib/communityTheme.ts": "Community theming utilities with default theme, font/background presets, and functions to apply custom themes to DOM elements.",
  "frontend/src/lib/documentFileMarkers.ts": "Utilities for creating, parsing, inserting, and removing file markers in document content using the format [FILE:id:filename].",
  "frontend/src/lib/documentImageMarkers.ts": "Utilities for creating, parsing, inserting, and removing image markers in document content using the format [IMAGE:id:caption].",
  "frontend/src/lib/documentPreviewMarkup.tsx": "React components and utilities for parsing and rendering document markup including file markers, inline spoilers, underlines, and line prefixes (center, big, heading, tiny).",
  "frontend/src/lib/imageValidation.ts": "Image validation utilities for checking file types (PNG/JPG), size limits (5MB), converting files to bytes, and creating preview URLs.",
  "frontend/src/lib/myCommunitiesHiddenStorage.ts": "Manages localStorage persistence for hidden community IDs using a Set, providing load, save, add, remove, and clear operations.",
  "frontend/src/lib/preferencesStorage.ts": "Handles user preferences (theme, background, nickname, UI scale) with localStorage persistence, validation, and clamping of uiScalePercent to 10-200 range.",
  "frontend/src/lib/quickChatProfileStorage.ts": "Manages quick chat profile (display name and avatar data URL) in localStorage with validation for structure, format, and size limits (5MB max).",
  "frontend/src/lib/rollCommand.ts": "Validates dice roll command patterns (e.g., d20, 2d6+3) by checking for 'd' character and allowed characters before backend parsing.",
  "frontend/src/lib/sessionExportFile.ts": "Handles session export/import as JSON files with versioning, creating downloadable blobs and parsing uploaded files with structure validation.",
  "frontend/src/lib/sessionStorage.ts": "Persists current session context (sessionId, nickname, isHost) to localStorage with get, set, and clear operations.",
  "frontend/src/lib/templateHistoryStorage.ts": "Manages session template storage in localStorage, providing save, load, clear, and validation functions for SessionExport data.",
  "frontend/src/lib/time.ts": "Formats bigint nanosecond timestamps to human-readable strings, showing time-only for today or date+time for older timestamps.",
  "frontend/src/main.tsx": "Application entry point that renders the root App component wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CommunitiesHubPage.tsx": "Displays a communities hub with tabs for 'My Communities' and 'Discover', featuring search, community cards, and create/join dialogs with hidden communities filtering.",
  "frontend/src/pages/LobbyPage.tsx": "Pre-session lobby page with tabs for hosting or joining sessions, settings dialog, and template application on session creation.",
  "frontend/src/pages/SessionPage.tsx": "Main session page managing view state (channels, player documents, session documents), sidebar navigation, and communities hub toggle with view restoration.",
  "frontend/src/types/community.ts": "TypeScript type definitions for Community entities including SubPlace types (Chat, Documents, RPG), CommunityTheme with styling properties, privacy/join settings, and form data interfaces for community creation/editing.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme properties for sidebar/chart/card components, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document identifying Android/mobile UI issues (chat width, dynamic resizing, modal scrolling) and defining four feature requests to improve mobile responsiveness and touch usability."
}