{
  "backend/main.mo": "Defines the backend actor and all data types for sessions, documents, channels, messages, files, images, and related responses.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files describing their purpose and behavior.",
  "frontend/docs/regression-test-plan-player-document-uploads.md": "Regression test plan detailing scenarios for player and session document uploads, visibility, markup, and error handling.",
  "frontend/index.css": "Tailwind-based global CSS defining light/dark theme variables and base styling for the application.",
  "frontend/index.html": "HTML entry point initializing stored theme mode and loading the main React application.",
  "frontend/src/App.tsx": "Main React app component handling authentication, profile setup, session restoration, startup guard, logout, and global scaling.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that displays an error screen with reload and clear-local-data options.",
  "frontend/src/components/app/StartupFailureScreen.tsx": "Startup failure UI showing initialization errors with actions to reload or clear local data.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Channel chat interface handling message sending, replies, image uploads, and auto‑scroll behavior.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders individual chat messages with avatars, reply previews, long‑press detection, and user identity handling.",
  "frontend/src/components/docs/DocumentCommentsSection.tsx": "Displays document comments with add and delete functionality, including confirmation dialogs and error handling.",
  "frontend/src/components/docs/DocumentContentPreview.tsx": "Parses document content to render text and embedded file references, supporting images and downloadable files.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Document editor enabling content editing, file uploads, preview mode, and saving with error and progress handling.",
  "frontend/src/components/docs/ImageUploadWithTitleDialog.tsx": "Dialog component for selecting, validating, and uploading an image with an optional title.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Full editor for player documents supporting content editing, file uploads, image insertion, and visibility settings.",
  "frontend/src/components/profile/Avatar.tsx": "Avatar component that displays a profile image or fallback initials with size options.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "UI for uploading, previewing, and removing a user's profile picture with validation and progress tracking.",
  "frontend/src/components/profile/QuickChatProfileDialog.tsx": "Dialog for setting a temporary display name and avatar stored locally for quick chat use.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting channels within a session, with backend calls and validation.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Provides dialogs for creating, renaming, deleting, and locking host-owned documents, with backend calls and local state for errors and loading. Supports both controlled create dialogs and in-place rename/delete flows.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Implements session export and import UI for hosts, including file parsing, confirmation dialogs, and backend calls to save or load session data. Shows errors and loading states during operations.",
  "frontend/src/components/session/MembersChannelManagementDialogs.tsx": "Supplies dialogs for creating, renaming, and deleting members' channels using mutation hooks. Manages form state, validation, and success/error handling for channel operations.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Contains dialogs and menus for creating, renaming, deleting, and toggling visibility of player documents. Integrates mutation hooks and UI components for owner-specific document actions.",
  "frontend/src/components/session/PlayerDocumentsDialog.tsx": "Displays a list of player documents with ownership and privacy indicators, and allows selecting or creating new documents. Wraps creation dialog and triggers refetching after updates.",
  "frontend/src/components/session/SessionDocumentsDialog.tsx": "Dialog component for listing, creating, renaming, selecting, and deleting session documents using related hooks.",
  "frontend/src/components/session/SessionSidebar.tsx": "Sidebar UI for channel navigation, quick profile, UI scale, and collapsing behavior within a session.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Settings screen for theme, background, nickname, templates, and preference resets before entering a lobby.",
  "frontend/src/components/settings/UIScaleSettingsPopover.tsx": "Popover for adjusting UI scale via slider or numeric input with persistence in user preferences.",
  "frontend/src/config/polling.ts": "Defines polling intervals for messages, lists, session info, and document content.",
  "frontend/src/context/PreferencesContext.tsx": "Context provider handling user preferences load, save, update, reset, and theme application.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to authentication, refreshing dependent queries on change.",
  "frontend/src/hooks/useActorStartupGuard.ts": "Detects actor initialization failures or timeouts and reports startup errors.",
  "frontend/src/hooks/useDocumentComments.ts": "React Query hooks for fetching, adding, deleting, and updating document comments via the backend actor.",
  "frontend/src/hooks/useDocumentFiles.ts": "React Query hooks for listing, fetching, and uploading document file references with cache invalidation.",
  "frontend/src/hooks/useDocumentImages.ts": "Hooks to list document images and add images to session or player documents, with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and hooks to manage auth client creation, login, logout, and identity state.",
  "frontend/src/hooks/usePlayerDocuments.ts": "Hooks to list, fetch, create, rename, delete, edit, and update visibility of player documents with React Query.",
  "frontend/src/hooks/usePolling.ts": "Simple hook that runs a callback on a set interval when enabled.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports the usePreferences hook from the preferences context.",
  "frontend/src/hooks/useQuickChatProfile.ts": "Manages loading, saving, and clearing a user's quick chat profile from local storage.",
  "frontend/src/hooks/useSessionData.ts": "Aggregates session, channels, member channels, and messages queries with polling; includes mutations for members' channels.",
  "frontend/src/hooks/useSessionDocuments.ts": "Hooks to list, fetch, create, rename, delete, and edit session documents with cache updates.",
  "frontend/src/hooks/useUserDisplayName.ts": "Fetches a user's display name from their profile or falls back to a shortened principal.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for loading, saving, and modifying user profiles via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus theme variables and layout rules for chat, sessions, and communities UI.",
  "frontend/src/lib/clearLocalAppData.ts": "Clears specific localStorage keys and sessionStorage for app reset.",
  "frontend/src/lib/documentFileMarkers.ts": "Creates, parses, inserts, and removes file marker tags in document text.",
  "frontend/src/lib/documentImageMarkers.ts": "Creates, parses, inserts, and removes image marker tags in document text.",
  "frontend/src/lib/documentPreviewMarkup.tsx": "Parses text into tokens and renders inline markup with spoilers, underlines, and prefixed styles.",
  "frontend/src/lib/myCommunitiesHiddenStorage.ts": "Manages storage of hidden community IDs using localStorage.",
  "frontend/src/lib/preferencesStorage.ts": "Loads, saves, and resets user preferences with validation and clamping for UI scale.",
  "frontend/src/lib/quickChatProfileStorage.ts": "Loads, saves, validates, and clears quick chat profile data in localStorage.",
  "frontend/src/lib/rollCommand.ts": "Validates basic dice roll command patterns and checks for allowed characters.",
  "frontend/src/lib/sessionExportFile.ts": "Creates, downloads, and parses session export JSON files with version validation.",
  "frontend/src/lib/sessionStorage.ts": "Stores, retrieves, and clears session context data in localStorage.",
  "frontend/src/lib/templateHistoryStorage.ts": "Manages saving, loading, clearing, and validating session templates in localStorage.",
  "frontend/src/lib/time.ts": "Formats bigint timestamps into readable time or date strings.",
  "frontend/src/main.tsx": "Application entry point setting up React, React Query, and Internet Identity provider.",
  "frontend/src/pages/CommunitiesHubPage.tsx": "Defines the Communities Hub UI with tabs, search, and local hide-state for community cards, using static community lists.",
  "frontend/src/pages/LobbyPage.tsx": "Implements hosting and joining sessions with forms, validation, template application, and loading states.",
  "frontend/src/pages/SessionPage.tsx": "Manages the main session UI including channels, documents, and navigation, with state for selected views and dialogs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Stores project metadata, features, and pending requests for the Communities Hub."
}