{
  "backend/main.mo": "Defines the backend actor with numerous data types for sessions, documents, messages, files, images, and storage integration via mixins.",
  "feature_evidence.json": "Feature evidence report detailing implemented features, associated files, components, and test IDs for preview/edit mode and file marker rendering.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend source files describing their responsibilities within the app.",
  "frontend/index.css": "Tailwind base and custom CSS variables defining light/dark theme color tokens and global styling.",
  "frontend/index.html": "HTML entry point initializing theme mode early and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup, session restoration, logout, and routing to Lobby or Session.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "Error boundary component that catches app errors and offers reload or local data clearing options.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Chat view handling message input, roll commands, image upload, and posting messages with auto-scroll.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders individual chat messages with avatars, timestamps, roll badges, and optional image attachments.",
  "frontend/src/components/docs/DocumentCommentsSection.tsx": "Displays document comments, allows adding and deleting comments, and manages permissions and error states.",
  "frontend/src/components/docs/DocumentContentPreview.tsx": "Parses content for file markers and renders text, inline images, or download blocks for attached files.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Document editor supporting content editing, saving, file uploads, image insertion, and preview mode.",
  "frontend/src/components/docs/ImageUploadWithTitleDialog.tsx": "Modal dialog for selecting, validating, titling, and uploading an image file.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Editor UI for viewing, editing, saving, and managing visibility, files, and images within a player document.",
  "frontend/src/components/profile/Avatar.tsx": "Renders a user avatar with fallback initials and optional image handling with error recovery.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "Manages uploading, removing, and displaying a user's profile picture with validation and progress tracking.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting channels within a session, including form validation and API calls.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Dialogs for creating, renaming, deleting, and locking/unlocking documents in a session.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Provides UI to export and import session data, including file parsing, confirmation, and error handling.",
  "frontend/src/components/session/MembersChannelManagementDialogs.tsx": "UI dialogs for creating, renaming, and deleting member channels with mutation handlers and validation.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Components for creating, renaming, deleting, and managing visibility of player documents using related mutations.",
  "frontend/src/components/session/PlayerDocumentsDialog.tsx": "Displays a list of player-owned documents and provides a dialog for creating new ones and selecting existing ones.",
  "frontend/src/components/session/SessionDocumentsDialog.tsx": "Handles listing, creating, renaming, and deleting session-wide documents with modal dialogs and mutation logic.",
  "frontend/src/components/session/SessionSidebar.tsx": "Renders the session sidebar showing host channels and member channels with controls to create and manage them.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "UI component for managing user preferences like theme, background image, nickname, and template import/reset with stateful success/error handling.",
  "frontend/src/config/polling.ts": "Defines polling interval constants for various data fetch operations.",
  "frontend/src/context/PreferencesContext.tsx": "Provides a React context for loading, saving, updating, and resetting user preferences including theme mode.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useDocumentComments.ts": "React Query hooks to list, add, update, and delete document comments through the backend actor.",
  "frontend/src/hooks/useDocumentFiles.ts": "React Query hooks for listing file references, fetching a specific file reference, and uploading document files.",
  "frontend/src/hooks/useDocumentImages.ts": "Hooks for listing document images and adding images to GM or player documents with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook for managing identity state and login flow.",
  "frontend/src/hooks/usePlayerDocuments.ts": "Hooks to list, fetch, create, rename, delete, edit, and update visibility of player documents.",
  "frontend/src/hooks/usePolling.ts": "Custom hook that runs a callback on a timed interval when enabled.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports the usePreferences hook from the preferences context.",
  "frontend/src/hooks/useSessionData.ts": "Provides React Query hooks to fetch and poll session details, channels, members’ channels, and messages, plus mutations for managing members’ channels.",
  "frontend/src/hooks/useSessionDocuments.ts": "Implements queries and mutations for listing, retrieving, creating, editing, renaming, and deleting session documents via the backend actor.",
  "frontend/src/hooks/useUserDisplayName.ts": "Fetches a user’s display name from their profile or falls back to a shortened principal string.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to load, update, and manage user profiles, including caller profile and profile picture removal.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light and dark theme CSS variables with a warm green accent palette.",
  "frontend/src/lib/clearLocalAppData.ts": "Clears specific localStorage keys and all sessionStorage entries with error handling.",
  "frontend/src/lib/documentFileMarkers.ts": "Handles creation, parsing, insertion, and removal of inline file markers embedded in document content.",
  "frontend/src/lib/documentImageMarkers.ts": "Manages creation, parsing, insertion, and removal of inline image markers within document text.",
  "frontend/src/lib/preferencesStorage.ts": "Loads, saves, and resets user UI preferences stored in localStorage.",
  "frontend/src/lib/rollCommand.ts": "Validates basic dice roll command patterns and returns simple validation results.",
  "frontend/src/lib/sessionExportFile.ts": "Creates, downloads, and parses JSON session export files with version validation.",
  "frontend/src/lib/sessionStorage.ts": "Stores, loads, and clears session context data in localStorage.",
  "frontend/src/lib/templateHistoryStorage.ts": "Saves, loads, clears, and validates session template data in localStorage.",
  "frontend/src/lib/time.ts": "Formats timestamps into readable time or date-time strings depending on recency.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/pages/LobbyPage.tsx": "UI for hosting or joining sessions, managing form state, applying templates, and invoking actor API to create or join a session.",
  "frontend/src/pages/SessionPage.tsx": "Main session UI that loads channels, documents, and messages, and switches between chat, player documents, and session documents.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, animations, and plugins for typography, container queries, and UI theming.",
  "project_state.json": "Project metadata describing current features, requirements, and planned preview-mode functionality for document rendering."
}