{
  "backend/main.mo": "Defines core actor types for sessions, documents, channels, messages, file/image references, and includes blob storage mixin but no logic due to truncation.",
  "feature_evidence.json": "Lists feature evidence records mapping feature IDs to related frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose and behavior of major frontend components, hooks, utilities, and styling files.",
  "frontend/docs/regression-test-plan-player-document-uploads.md": "Regression test plan detailing scenarios for verifying player document file/image uploads, error handling, and preventing regressions in session document uploads.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color variables, dark mode overrides, and base layout styling.",
  "frontend/index.html": "HTML entry point that initializes theme mode from localStorage and loads the React app root and main module.",
  "frontend/src/App.tsx": "Root React component handling Internet Identity auth, profile setup, session restoration, logout, and conditional rendering of Lobby or Session pages with global UI scaling.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that displays a fallback UI with reload and data‑clear options when an unhandled error occurs.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Chat view handling message input, auto‑scrolling, roll commands, image uploads, and posting messages to a channel.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders an individual chat message with avatar, reply context, image support, and long‑press handling.",
  "frontend/src/components/docs/DocumentCommentsSection.tsx": "Displays document comments with add/delete functionality and user identity checks.",
  "frontend/src/components/docs/DocumentContentPreview.tsx": "Parses content for embedded file markers and renders text, images, or downloadable file attachments.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Document editor supporting content editing, file uploads, image insertion, preview mode, and saving via backend actor.",
  "frontend/src/components/docs/ImageUploadWithTitleDialog.tsx": "Dialog for selecting, validating, and uploading an image with an optional title.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Full editor view for player documents with saving, visibility control, file uploads, and image insertion.",
  "frontend/src/components/profile/Avatar.tsx": "Avatar component showing an image or user initials with size options and fallback handling.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "User profile picture uploader with validation, progress tracking, and removal controls.",
  "frontend/src/components/profile/QuickChatProfileDialog.tsx": "Dialog to set a temporary display name and avatar stored locally for quick chat use.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting session channels with validation and backend calls.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Provides dialogs for creating, renaming, deleting, and locking documents tied to a session using actor calls and UI modals.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "Implements session export and import controls with file handling, confirmation dialogs, and error reporting.",
  "frontend/src/components/session/MembersChannelManagementDialogs.tsx": "Contains dialogs to create, rename, and delete members' channels via session data mutation hooks.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Provides dialogs and menus to create, rename, delete, and manage visibility of player-owned documents using related hooks.",
  "frontend/src/components/session/PlayerDocumentsDialog.tsx": "Displays a list of a player's documents with ownership info and allows creating or selecting documents within a session.",
  "frontend/src/components/session/SessionDocumentsDialog.tsx": "Dialog for listing, creating, renaming, deleting, and selecting session documents using related hooks.",
  "frontend/src/components/session/SessionSidebar.tsx": "Sidebar component for channel navigation, profile access, UI scale settings, and collapsible layout.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Settings page for theme, background, nickname, templates, and resetting user preferences.",
  "frontend/src/components/settings/UIScaleSettingsPopover.tsx": "Popover allowing users to adjust and reset UI scale via slider or numeric input.",
  "frontend/src/config/polling.ts": "Defines polling intervals for messages, lists, session info, and document content.",
  "frontend/src/context/PreferencesContext.tsx": "Context provider managing user preferences with persistence, theme application, and reset support.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor instance tied to Internet Identity, with query invalidation on change.",
  "frontend/src/hooks/useDocumentComments.ts": "Hooks for fetching, adding, updating, and deleting document comments with automatic cache invalidation.",
  "frontend/src/hooks/useDocumentFiles.ts": "Hooks for listing, retrieving, and uploading document file references with validation and cache updates.",
  "frontend/src/hooks/useDocumentImages.ts": "Provides React Query hooks for listing and adding images to session or player documents, with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider to manage login, identity loading, and status handling.",
  "frontend/src/hooks/usePlayerDocuments.ts": "Supplies hooks to list, fetch, create, edit, rename, delete, and update visibility of player documents using React Query.",
  "frontend/src/hooks/usePolling.ts": "Defines a simple polling hook that repeatedly invokes a callback on an interval when enabled.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports the usePreferences hook from the PreferencesContext for compatibility.",
  "frontend/src/hooks/useQuickChatProfile.ts": "Manages loading, saving, and clearing a local quick chat profile with simple state handling.",
  "frontend/src/hooks/useSessionData.ts": "Aggregates session-related queries for session info, channels, members channels, and messages, plus related mutations.",
  "frontend/src/hooks/useSessionDocuments.ts": "Provides hooks to list, fetch, create, edit, rename, and delete session documents with cache invalidation.",
  "frontend/src/hooks/useUserDisplayName.ts": "Fetches a user's display name with fallback to shortened principal when unavailable.",
  "frontend/src/hooks/useUserProfile.ts": "Implements hooks to fetch and update user profiles and profile pictures using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables for light/dark modes, and layout styles for chat and session pages. Includes mobile scrolling fixes and chat bubble styling.",
  "frontend/src/lib/clearLocalAppData.ts": "Clears specific app-related localStorage keys and clears sessionStorage with error handling.",
  "frontend/src/lib/documentFileMarkers.ts": "Provides utilities to create, parse, insert, and remove file markers embedded in text content.",
  "frontend/src/lib/documentImageMarkers.ts": "Provides utilities to create, parse, insert, and remove image markers embedded in text content.",
  "frontend/src/lib/preferencesStorage.ts": "Handles saving, loading, clamping, and resetting user UI preferences in localStorage.",
  "frontend/src/lib/quickChatProfileStorage.ts": "Manages loading, validating, saving, and clearing a quick-chat profile including avatar data URLs.",
  "frontend/src/lib/rollCommand.ts": "Validates basic dice roll command patterns and returns errors for malformed input.",
  "frontend/src/lib/sessionExportFile.ts": "Creates, downloads, and parses versioned JSON session export files with validation.",
  "frontend/src/lib/sessionStorage.ts": "Stores, loads, and clears basic session context (ID, nickname, host flag) in localStorage.",
  "frontend/src/lib/templateHistoryStorage.ts": "Saves, loads, clears, and validates session templates stored in localStorage.",
  "frontend/src/lib/time.ts": "Formats bigint nanosecond timestamps into human-readable date or time strings.",
  "frontend/src/main.tsx": "Initializes React app with Internet Identity and React Query providers and loads global CSS.",
  "frontend/src/pages/LobbyPage.tsx": "Renders lobby UI for hosting or joining sessions, handles form state, template application, and session creation.",
  "frontend/src/pages/SessionPage.tsx": "Main session view managing channel selection, document viewing, and UI state for chat and documents. Integrates multiple hooks to load session data and switch between channels and documents.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, animations, container settings, and plugins like typography and container queries.",
  "project_state.json": "Project state metadata describing app features, issues, and pending requests for chat layout fixes and auto-scroll behavior."
}