{
  "backend/main.mo": "Defines core backend types for sessions, documents, channels, messages, images, files, and storage mixins; no logic beyond type declarations is shown.",
  "feature_evidence.json": "Lists implemented UI scale–related features with associated source files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files describing their purpose and functionality.",
  "frontend/docs/regression-test-plan-player-document-uploads.md": "Markdown regression test plan covering image and file upload flows for player and session documents, including error and regression checks.",
  "frontend/index.css": "Global Tailwind-based styles defining OKLCH color variables, light/dark theme values, and base element styling.",
  "frontend/index.html": "HTML entry point bootstrapping theme mode early and loading the React application root.",
  "frontend/src/App.tsx": "Main React app container handling authentication, profile setup, session restoration, routing, and global providers with loading and logout logic.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that displays an error alert and offers reload or clearing local data when uncaught errors occur.",
  "frontend/src/components/chat/ChannelChatView.tsx": "Chat UI for a channel with message sending, roll command handling, image upload, reply support, and auto‑scrolling.",
  "frontend/src/components/chat/ChatMessageItem.tsx": "Renders a single chat message with avatar, images, reply indicators, roll formatting, and long‑press detection.",
  "frontend/src/components/docs/DocumentCommentsSection.tsx": "Displays document comments with add/delete actions, loading states, and confirmation dialogs.",
  "frontend/src/components/docs/DocumentContentPreview.tsx": "Parses document content for file markers and renders text, inline images, or downloadable file blocks.",
  "frontend/src/components/docs/DocumentEditorView.tsx": "Full document editor with saving, preview toggle, file uploads, image insertion, and unsaved‑changes tracking.",
  "frontend/src/components/docs/ImageUploadWithTitleDialog.tsx": "Dialog component for selecting, validating, titling, and uploading an image with error handling.",
  "frontend/src/components/docs/PlayerDocumentEditorView.tsx": "Editor view for player documents supporting editing, saving, previewing, file uploads, and image insertion.",
  "frontend/src/components/profile/Avatar.tsx": "Avatar component showing a user image or generated initials with size options and fallback handling.",
  "frontend/src/components/profile/ProfilePictureSection.tsx": "Profile picture manager allowing upload, validation, progress tracking, and removal of user images.",
  "frontend/src/components/session/ChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting session channels with validation and loading states.",
  "frontend/src/components/session/DocumentManagementDialogs.tsx": "Dialogs for creating, renaming, locking, and deleting documents, including content input and error handling.",
  "frontend/src/components/session/HostSessionSaveLoad.tsx": "UI component that lets a session host export or import session data, handling file parsing, confirmation, and errors.",
  "frontend/src/components/session/MembersChannelManagementDialogs.tsx": "Dialogs for creating, renaming, and deleting members' channels with form handling and mutation calls.",
  "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx": "Components for creating player documents and managing individual document actions like renaming, deleting, and visibility changes.",
  "frontend/src/components/session/PlayerDocumentsDialog.tsx": "Dialog for listing player documents, allowing selection, creation, and viewing ownership or privacy status.",
  "frontend/src/components/session/SessionDocumentsDialog.tsx": "Dialog for listing, creating, renaming, and deleting session-wide documents with selection and error handling.",
  "frontend/src/components/session/SessionSidebar.tsx": "Sidebar component showing channels, member channels, and UI controls with collapse and creation dialogs.",
  "frontend/src/components/settings/PreLobbySettingsView.tsx": "Settings screen for theme, nickname, background image, and template import/reset before entering a lobby.",
  "frontend/src/components/settings/UiScaleControl.tsx": "Popover control for adjusting UI scale with slider and preset buttons.",
  "frontend/src/config/polling.ts": "Defines polling intervals for messages, lists, session data, and document content.",
  "frontend/src/context/PreferencesContext.tsx": "Context provider for loading, saving, updating, and resetting user preferences with theme and UI scale effects.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and maintains the backend actor tied to identity and invalidates related queries on change.",
  "frontend/src/hooks/useDocumentComments.ts": "Hooks for listing, adding, updating, and deleting document comments using the backend actor.",
  "frontend/src/hooks/useDocumentFiles.ts": "Hooks for listing document files, fetching file references, and uploading files with query invalidation.",
  "frontend/src/hooks/useDocumentImages.ts": "Hooks for listing images and adding images to documents or player documents with query updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication, including loading, login, logout, and tracking login status.",
  "frontend/src/hooks/usePlayerDocuments.ts": "React-query hooks for listing, fetching, creating, updating, deleting, and modifying visibility of player documents via the backend actor.",
  "frontend/src/hooks/usePolling.ts": "Simple hook that runs a callback on an interval when enabled.",
  "frontend/src/hooks/usePreferences.ts": "Re-exports the usePreferences hook from the preferences context for compatibility.",
  "frontend/src/hooks/useSessionData.ts": "React-query hooks to load session data, channels, members’ channels, and messages with polling plus mutations for managing member channels.",
  "frontend/src/hooks/useSessionDocuments.ts": "React-query hooks for listing, fetching, creating, renaming, editing, and deleting session documents.",
  "frontend/src/hooks/useUserDisplayName.ts": "Fetches a user's display name with fallback formatting for principals when unavailable.",
  "frontend/src/hooks/useUserProfile.ts": "React-query hooks for retrieving and modifying user profiles, including saving profile data and removing profile pictures.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining theming, dark mode, UI scaling, and utility classes.",
  "frontend/src/lib/clearLocalAppData.ts": "Clears specific localStorage keys and all sessionStorage entries with error handling.",
  "frontend/src/lib/documentFileMarkers.ts": "Utility functions for creating, parsing, inserting, and removing file marker tags in document content.",
  "frontend/src/lib/documentImageMarkers.ts": "Utility functions for creating, parsing, inserting, and removing image marker tags in document content.",
  "frontend/src/lib/preferencesStorage.ts": "Manages user preference storage in localStorage with defaults and clamped UI scale.",
  "frontend/src/lib/rollCommand.ts": "Validates simple dice roll command patterns and returns basic validity info.",
  "frontend/src/lib/sessionExportFile.ts": "Creates, downloads, and parses session export JSON files with version checking.",
  "frontend/src/lib/sessionStorage.ts": "Stores and retrieves session context data in localStorage, including sessionId and user info.",
  "frontend/src/lib/templateHistoryStorage.ts": "Saves, loads, clears, and validates session templates stored in localStorage.",
  "frontend/src/lib/time.ts": "Formats bigint timestamps into human‑readable date or time strings.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/LobbyPage.tsx": "UI logic for hosting or joining sessions, loading templates, and handling authentication state.",
  "frontend/src/pages/SessionPage.tsx": "Manages session view state, loading channels and documents, and switching between chat and editors.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, themes, animations, and plugins.",
  "project_state.json": "Defines current project metadata, existing UI scale feature entries, and a pending new feature request for expanding the UI scale range. Contains project configuration fields such as versioning, issues, and architectural notes."
}