{
  "kind": "build_request",
  "title": "Make Session header fully visible and free space for more chat messages",
  "projectName": "RPG Collaboration",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Update the Session page header (/html/body/div/div/div/header) so it is fully visible on phone-sized screens without any clipping or horizontal overflow. This must be implemented by changing ONLY the SessionPage header markup/styles (the <header> in frontend/src/pages/SessionPage.tsx).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-9",
          "msg-11"
        ],
        "quotes": [
          "You see this i want the chat to be a big bigger seeing like 3 more messages and the header to be shown completely",
          "Start now",
          "Try again"
        ]
      },
      "acceptanceCriteria": [
        "On a narrow/mobile viewport, the entire header content (Leave button, session name/ID/host label, Documents/Player Documents buttons, members count, logout icon) is visible without being cut off.",
        "Header content does not overflow horizontally; no element is partially off-screen.",
        "No unintended page-level horizontal scrolling is introduced by the header."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Reduce the vertical height of the Session page header (/html/body/div/div/div/header) to provide more vertical space to the main content (chat), targeting enough reclaimed space to show approximately ~3 additional chat messages in the visible message list on mobile. Implement this ONLY by adjusting the header’s spacing/typography/layout in frontend/src/pages/SessionPage.tsx (e.g., padding, gaps, font sizes, wrapping), without changing the chat component itself.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-9"
        ],
        "quotes": [
          "Perfect now because this part don't show up completely i need you to slace the chat a bit more than this to line up",
          "You see this i want the chat to be a big bigger seeing like 3 more messages and the header to be shown completely"
        ]
      },
      "acceptanceCriteria": [
        "Compared to the current UI, the header occupies less vertical space on mobile (visibly shorter).",
        "The chat message list visibly gains vertical space equivalent to ~3 message bubbles (approximate, not pixel-perfect).",
        "No functional regressions: header buttons still work (Leave, Documents, Player Documents, Logout)."
      ]
    }
  ],
  "constraints": [
    "Apply changes ONLY to the selected element: the SessionPage header (<header> in frontend/src/pages/SessionPage.tsx).",
    "Do not edit any files under frontend/src/components/ui or any immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not redesign the overall app theme or colors.",
    "Do not modify chat scrolling/auto-scroll behavior as part of this change.",
    "Do not change backend logic or data models."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}