{
  "kind": "build_request",
  "title": "Fix app stuck on “Initializing…” after deployment",
  "projectName": "RPG Collaboration",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the initialization hang by making actor initialization timeouts trigger reliably and transition the UI away from the infinite “Initializing…” screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "It keeps \"Initializing..\" (loading after getting deployed)\nFix it."
        ]
      },
      "acceptanceCriteria": [
        "If backend actor creation/access-control initialization does not complete within 30 seconds, the app stops showing the infinite loading screen and shows the existing InitializationFailureScreen with a timeout error message.",
        "The timeout mechanism does not reset continuously during renders while actor initialization is still in progress (i.e., the 30-second timer actually fires).",
        "Clicking “Retry Initialization” retries actor initialization without requiring a full page reload loop that immediately returns to the same stuck state."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Surface actor creation failures immediately (not only via timeout) so the app shows InitializationFailureScreen when the actor query fails due to exceptions/traps during initialization.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "It keeps \"Initializing..\" (loading after getting deployed)\nFix it."
        ]
      },
      "acceptanceCriteria": [
        "When the actor creation query fails quickly (e.g., rejected promise, agent error, canister trap), the error is captured and InitializationFailureScreen is shown with the error message.",
        "The app does not remain on “Initializing…” indefinitely when an actor initialization error occurs before the timeout."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Prevent access-control initialization from causing an indefinite initialization state by handling missing/empty admin token initialization safely on the frontend (and only attempting secret-based initialization when a token is present).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "It keeps \"Initializing..\" (loading after getting deployed)\nFix it."
        ]
      },
      "acceptanceCriteria": [
        "If no `caffeineAdminToken` secret is present (via the existing getSecretParameter flow), actor initialization does not call secret-based access-control initialization with an empty string.",
        "The app successfully reaches the login screen or main app flow (depending on authentication state) on a fresh load with no admin token present."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a minimal, user-visible recovery path for initialization issues: ensure InitializationFailureScreen provides enough actionable detail to unblock users stuck at startup (keep all user-facing text in English).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "It keeps \"Initializing..\" (loading after getting deployed)\nFix it."
        ]
      },
      "acceptanceCriteria": [
        "InitializationFailureScreen continues to display an English error summary plus the underlying error message (e.g., timeout vs. initialization failure).",
        "“Clear Local Data & Retry” clears local/session storage using the existing clearLocalAppData path and then re-attempts initialization successfully when the underlying issue is stale client state.",
        "No infinite spinner remains after a failure; the user always ends up on either InitializationFailureScreen, the login prompt, profile setup, lobby, or session UI."
      ]
    }
  ],
  "constraints": [
    "Do not modify files in frontend immutablePaths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui.",
    "Backend must remain a single Motoko actor in backend/main.mo; only introduce backend state migration if persistent state schema changes (not expected for this fix).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new authentication providers (only Internet Identity is supported).",
    "Implementing real-time communication (WebSockets) or new backend services.",
    "Introducing new product features unrelated to initialization reliability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}