{
  "kind": "build_request",
  "title": "Add Players' Documents sidebar section and per-document privacy toggle",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new sidebar section directly below the existing \"Documents\" section titled \"PLAYERS' DOCUMENTS\" that lists player-owned documents for the current session and allows selecting a player document to open it in the main panel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-players-docs"
        ],
        "quotes": [
          "Add a new section below DOCUMENTS called \"PLAYERS' DOCUMENTS\""
        ]
      },
      "acceptanceCriteria": [
        "Session sidebar shows a new header \"PLAYERS' DOCUMENTS\" below \"Documents\".",
        "The section displays a list of player documents returned for the active session.",
        "Clicking a player document switches the main panel to that player document view."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Session page navigation/state so it supports selecting and rendering a player document in the main panel (in addition to channels and shared documents), using the existing PlayerDocumentEditorView for the selected player document.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-players-docs"
        ],
        "quotes": [
          "Add a new section below DOCUMENTS called \"PLAYERS' DOCUMENTS\""
        ]
      },
      "acceptanceCriteria": [
        "SessionPage supports a third view type for player documents.",
        "Selecting a player document renders PlayerDocumentEditorView with the selected player document id.",
        "Switching between channel/shared document/player document updates the main panel accordingly without breaking existing channel/document behavior."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a simple per-player-document privacy control as a toggle/checkbox labeled \"Private\" (or \"Hide from others\") for the document owner; when enabled, the document is not visible to any other session members; when disabled, the document is visible and behaves like a shared doc for viewing/editing (as allowed by the app’s current permissions model).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-players-docs"
        ],
        "quotes": [
          "Add a simple toggle/checkbox on each player's document: \"Hide from others\" (or \"Private\")",
          "If it's checked none of the members can see it",
          "If unchecked → everyone sees/edits it like shared docs."
        ]
      },
      "acceptanceCriteria": [
        "For the owner of a player document, the UI shows a clearly labeled checkbox/toggle: \"Private\" (or \"Hide from others\").",
        "Toggling the control updates the document’s visibility via the backend API and the UI reflects the new state.",
        "When a player document is Private, other session members cannot open it and do not see it listed in the \"PLAYERS' DOCUMENTS\" section.",
        "When a player document is not Private, other session members can open it; editing behavior matches the app’s intended permissions for non-owners (if non-owners are allowed to edit, edits persist; otherwise they are read-only)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Enforce privacy on the backend so that when a player document is marked Private/hidden, only the document owner can fetch its content (and it is excluded from list responses for non-owners).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-players-docs"
        ],
        "quotes": [
          "If it's checked none of the members can see it",
          "Simplest implementation: when private, client just + owner visible to all (or even hide title if easier — decide what's cleanest)."
        ]
      },
      "acceptanceCriteria": [
        "Backend listPlayerDocuments(sessionId) returns only documents that are visible OR owned by the caller.",
        "Backend getPlayerDocument(documentId) returns null (or a safe non-revealing response) for non-owners when the document is Private/hidden.",
        "Backend editPlayerDocument(documentId, ...) continues to restrict edits to the owner when the document is Private/hidden."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui; compose existing UI components instead.",
    "Keep all backend logic in the single Motoko actor (backend/main.mo).",
    "Only add a state migration (backend/migration.mo) if required by a persisted state schema change; prefer reusing the existing PlayerDocument.visible field for privacy."
  ],
  "nonGoals": [
    "Client-side encryption for private documents.",
    "Partial visibility modes (e.g., host can always view private content) unless already supported; private means hidden from all other members.",
    "Adding new authentication providers beyond Internet Identity.",
    "Real-time syncing via websockets; use existing polling/query invalidation patterns."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}