{
  "kind": "build_request",
  "title": "Expand UI scale range to 10%–200%",
  "projectName": "Session Chat",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the UI scale control so the slider range is 10% minimum to 200% maximum (instead of 70%–130%), and ensure any slider-driven changes are clamped to 10–200.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I need to make it from 10% to 200% instead of 70% to 130%"
        ]
      },
      "acceptanceCriteria": [
        "In the UI scale settings popover, the slider minimum is 10 and maximum is 200.",
        "Dragging the slider cannot set uiScale below 10 or above 200 (value is clamped).",
        "The displayed label reflects the current uiScale value in percent."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the UI scale preset buttons to align with the new 10%–200% range (add/adjust presets so they cover small, normal, and large values within 10–200).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I need to make it from 10% to 200% instead of 70% to 130%"
        ]
      },
      "acceptanceCriteria": [
        "The preset buttons only contain values between 10 and 200 inclusive.",
        "Clicking a preset sets the uiScale preference to that preset value and the slider updates accordingly."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Harden preference loading/updating so a previously stored uiScale outside the 10%–200% range is automatically clamped into the valid range on load and when saving updates.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I need to make it from 10% to 200% instead of 70% to 130%"
        ]
      },
      "acceptanceCriteria": [
        "If localStorage contains an out-of-range uiScale value (e.g., 0 or 999), the app clamps it to the nearest valid value (10 or 200) and applies that clamped value to the UI scale CSS variable.",
        "No part of the app applies a --ui-scale value corresponding to less than 10% or greater than 200%."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not change backend canister logic; UI scale remains a purely frontend/localStorage preference."
  ],
  "nonGoals": [
    "Adding new settings unrelated to UI scaling.",
    "Changing the overall UI scaling mechanism (keep using the existing --ui-scale and app-scale-wrapper approach)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}