{
  "kind": "build_request",
  "title": "Add Preview/Edit mode to Document editor with inline file rendering",
  "projectName": "Session Docs",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a Preview/Edit toggle control to the session document editor screen (DocumentEditorView) that switches between the existing editable textarea and a read-only preview view. User-facing labels must be in English (\"Preview\" and \"Edit\").",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Goal: Add a \"Preview\" button (or toggle switch) in the document editor screen."
        ]
      },
      "acceptanceCriteria": [
        "A control is visible in the document editor UI that toggles between Edit and Preview modes.",
        "When in Preview mode, the textarea is not shown and content cannot be edited.",
        "When in Edit mode, the current behavior remains unchanged (textarea editing, upload buttons, save button, etc.)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a minimal preview renderer for document content that parses embedded file markers in the form \"[FILE:<id>:<filename>]\" and renders the document as a scrollable, formatted read-only view with inline file items at the marker positions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "For each [FILE:id:filename.ext] tag → display the corresponding image inline at that position in the flow",
          "In preview: parse noteContent - Split by /\\[FILE:(\\d+):([^\\]]+)\\]/g"
        ]
      },
      "acceptanceCriteria": [
        "Preview mode renders the full content in reading order (text segments interleaved with file elements).",
        "Multiline text is preserved (line breaks are visible) using standard HTML/text rendering approaches (no new libraries).",
        "File markers are detected using the existing marker format used by the editor (\"[FILE:id:filename]\") and are not shown verbatim in preview output.",
        "The preview area is scrollable within the editor panel."
      ]
    },
    {
      "id": "REQ-3",
      "text": "In preview mode, resolve each file marker to the corresponding uploaded file using the existing documentFiles list (via useListDocumentFiles) and the existing fileMap lookup (file ID -> file reference). Render images inline using the file’s direct URL; render non-image files inline as a small attachment row that shows the filename and provides an \"Open file\" action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Use the uploaded image (assume you have a map like fileIdToUri = { '1': 'file://.../e1eb...jpg' } or base64/data URI)",
          "If file is not image (pdf/txt), show filename + \"Open file\" button or placeholder"
        ]
      },
      "acceptanceCriteria": [
        "For markers whose file reference exists and has mimeType starting with \"image/\", an inline <img> is rendered at that location using fileRef.file.getDirectURL(), sized to fit the editor width (contain-style behavior).",
        "For markers whose file reference exists but mimeType is not an image, an inline element shows the filename and an \"Open file\" action (e.g., link/button) that opens/downloads the file URL.",
        "For markers whose file reference cannot be found, preview renders a clear inline placeholder (e.g., \"File not found: <filename>\") at that position.",
        "No backend changes are required; all preview rendering uses already-available frontend data (documentFiles + file.getDirectURL())."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Keep the change tightly scoped to the session DocumentEditorView only; do not modify upload logic, save logic, player documents UI, chat, stickers, or other unrelated screens.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Keep it minimal: - No new libraries if possible",
          "Do NOT change upload, save, player docs, chat, stickers, or anything else."
        ]
      },
      "acceptanceCriteria": [
        "No changes are made to backend Motoko canisters.",
        "No changes are made to PlayerDocumentEditorView or player-document management flows.",
        "Existing upload and save behaviors in DocumentEditorView continue to work as before in Edit mode."
      ]
    }
  ],
  "constraints": [
    "Do not add new third-party libraries for parsing/markdown; implement preview with simple string parsing and existing utilities.",
    "Do not edit files under frontend/src/components/ui or other frontend immutable paths (compose existing UI components only).",
    "Do not change backend schema or Motoko logic for this feature."
  ],
  "nonGoals": [
    "Markdown rendering (beyond basic multiline text preservation) and advanced rich-text formatting (e.g., bold/italics) are out of scope for this change.",
    "Changing how file markers are created/inserted/saved is out of scope.",
    "Reworking the existing image gallery and attachments sections beyond optionally hiding them in preview mode is out of scope."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}