{
  "kind": "build_request",
  "title": "Add markup preview tools for centered, sized, spoiler, and underlined text",
  "projectName": "Markup Preview Tools",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the document preview renderer used in the main session panel (selected element XPath: /html[1]/body[1]/div[1]/div[1]/div[1]/div[1]/main[1]/div[1]/div[2]/div[1]) so that plain-text content renders additional lightweight markup patterns in preview mode (without altering stored content):\n- \"[C] text\" renders as centered text in preview\n- \"[B] text\" renders as large text in preview\n- \"# text\" renders as extra-large heading text in preview\n- \"-# text\" renders as extra-small text in preview\n- \"||text||\" renders as spoiler/hidden text that can be clicked/tapped to reveal in preview\n- \"__text__\" (including when used like \"- __text__\") renders as underlined text in preview\nThis must work anywhere text is rendered inside DocumentContentPreview (including when mixed with existing [FILE:id:name] markers), and should apply to both session documents and player documents since both use the same preview component.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add those tools:\n\n [C] text  \n  → Centered text (in preview)\n\n [B] text  \n  → Large / big text (in preview)\n\n # text  \n  → Extra large text (very big, like a main heading) (in preview)\n\n -# text  \n  → Extra small text (very tiny) (in preview)\n\n ||text||  \n  → Spoiler / hidden text (click/tap to reveal) (in preview)\n\n- __text__  \n  → Underlined text (in preview)"
        ]
      },
      "acceptanceCriteria": [
        "Given document content containing lines starting with \"[C] \", the preview displays those lines centered (e.g., using Tailwind text-center) while preserving line breaks.",
        "Given document content containing lines starting with \"[B] \", the preview displays those lines with noticeably larger font size than normal preview text.",
        "Given document content containing lines starting with \"# \", the preview displays those lines as an extra-large heading style (largest of the provided options).",
        "Given document content containing lines starting with \"-# \", the preview displays those lines as extra-small text (smaller than normal preview text).",
        "Given document content containing \"||spoiler text||\", the preview hides the spoiler text by default and reveals it on click/tap; the interaction is accessible via keyboard (e.g., focusable + Enter/Space) and does not affect non-spoiler text.",
        "Given document content containing \"__underlined__\" (including within a bullet like \"- __underlined__\"), the preview renders just the wrapped text underlined, leaving surrounding characters like \"- \" intact.",
        "File marker rendering remains unchanged: images still render inline; non-image files still render as attachment rows; and text segments around file markers still apply the new markup rules where applicable.",
        "No backend changes are required; the raw stored content remains exactly as typed, with markup applied only in preview rendering."
      ]
    }
  ],
  "constraints": [
    "Apply the user-requested changes only to the preview rendering area associated with the selected element (i.e., implement within the document preview renderer used there, currently DocumentContentPreview).",
    "Do not modify any paths listed in frontend immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*).",
    "Keep backend as a single-actor Motoko canister; no backend schema/state changes for this request."
  ],
  "nonGoals": [
    "Implementing a full Markdown parser or rich-text editor.",
    "Changing how document content is stored or saved (no automatic rewriting/conversion of markup in persisted text).",
    "Adding real-time collaboration or chat markup unless explicitly requested."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}