{
  "kind": "build_request",
  "title": "Allow removing communities from My Communities",
  "projectName": "Communities Hub",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Communities Hub page, allow the user to remove (hide/delete) an existing community card from the \"My Communities\" section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Remove the communities that exists in my communities please"
        ]
      },
      "acceptanceCriteria": [
        "Each card in the \"My Communities\" grid provides a clear remove action (e.g., a remove button/menu) that is accessible and does not interfere with the existing \"Open\" button.",
        "When the user triggers the remove action, the community is removed from the \"My Communities\" list immediately in the UI.",
        "A confirmation step is shown before removal to prevent accidental deletes (user-facing text must be in English)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Persist the user’s removed \"My Communities\" state locally so removed communities stay removed after page refresh/reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Remove the communities that exists in my communities please"
        ]
      },
      "acceptanceCriteria": [
        "After removing one or more communities, reloading the app does not show the removed communities in \"My Communities\".",
        "Persistence is implemented entirely on the frontend (e.g., localStorage) without requiring backend changes.",
        "If local persistence is cleared (via existing clear/reset flows), the default \"My Communities\" list reappears."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the removal behavior only affects the \"My Communities\" section and does not remove or change items in the \"Discover\" section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Remove the communities that exists in my communities please"
        ]
      },
      "acceptanceCriteria": [
        "Removing a community from \"My Communities\" does not change the \"Discover\" grid.",
        "The \"Discover\" list remains fully functional and renders the same items as before."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose these components instead).",
    "Do not edit any files in frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx (immutable paths).",
    "Keep backend architecture as a single Motoko actor; no additional backend services."
  ],
  "nonGoals": [
    "Implementing real community backend CRUD (create/list/delete communities) in Motoko.",
    "Adding \"My Chats\", \"Profile\", or \"Notifications\" functionality beyond the existing placeholders.",
    "Changing the \"Open\" and \"Request to Join\" buttons to perform real navigation or network actions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}