{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Sidebar Settings UI scale control (mobile) with localStorage persistence",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a touch-friendly Settings button in the Session sidebar header that opens a popover/dialog to adjust UI scale percentage.",
      "acceptanceCriteria": [
        "A settings button is visible in the sidebar header row (same area as the existing collapse/expand button).",
        "Activating the button opens a UI scale control expressed as a percentage (e.g., slider and/or preset buttons).",
        "The scale control is usable on mobile (touch-friendly hit targets, readable labels)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/session/SessionSidebar.tsx",
          "operation": "modify",
          "description": "Add a Settings button within the existing sidebar header row container (same area as the collapse/expand button) and wire it to open a scale control UI. Use shadcn-ui components already used in this file (e.g., Button/Tooltip/DropdownMenu-style popover) to ensure consistent styling and mobile-friendly hit targets. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/settings/UiScaleControl.tsx",
          "operation": "create",
          "description": "Create a small Settings popover/dialog content component that renders a UI scale control in percentage (e.g., slider and/or preset percentage buttons), calling preferences update on change. Prefer shadcn-ui primitives for popover/dialog, slider, buttons, and labels to ensure accessible/touch-friendly interaction. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Persist UI scale percentage in the existing localStorage-backed preferences and restore on app load.",
      "acceptanceCriteria": [
        "UI scale preference is stored in the existing preferences storage (localStorage-backed) and survives page refresh.",
        "On reload, the previously selected percentage is applied automatically without requiring user action.",
        "A reasonable default is used when no preference exists (e.g., 100%)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/preferencesStorage.ts",
          "operation": "modify",
          "description": "Extend the existing UserPreferences type and DEFAULT_PREFERENCES to include a UI scale percentage preference (default 100). Ensure loadPreferences merges stored values safely and savePreferences persists the new field."
        },
        {
          "path": "frontend/src/context/PreferencesContext.tsx",
          "operation": "modify",
          "description": "Ensure the preferences provider applies/restores the stored UI scale preference on load by propagating it into a global CSS variable (or equivalent mechanism) alongside the existing theme application logic."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Apply the selected UI scale across the entire Session app UI without breaking scrolling/overflow, with bounded min/max limits.",
      "acceptanceCriteria": [
        "Changing the percentage immediately updates the perceived UI size across the Session page (sidebar, header, chat area, inputs).",
        "The Session page remains usable after scaling: content remains reachable via scrolling and key controls (message input, send button, sidebar toggle) stay accessible.",
        "The scale range is bounded to prevent unusable extremes (e.g., min/max limits)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/settings/UiScaleControl.tsx",
          "operation": "modify",
          "description": "Enforce bounded min/max scale values (e.g., 70–130%) and clamp any direct input/preset selection accordingly; update the preference immediately so the UI updates live. Prefer shadcn-ui controls for a consistent mobile UX. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the rendered application content in a single scaling container (e.g., a root wrapper div) that reads the global CSS scale variable so scaling applies consistently across Session layout (sidebar/header/chat/doc editors). Keep structure compatible with existing layout and error boundary/provider setup."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global styles to support whole-app scaling using a CSS variable (e.g., --ui-scale) with a safe default (1). Implement scaling in a way that preserves scroll/overflow usability (e.g., scale via transform/zoom plus compensating width/height rules on the app wrapper and appropriate transform-origin)."
        }
      ]
    }
  ]
}