{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Expand UI scale range to 10%–200%",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Expand the UI scale slider range to 10%–200% and clamp slider-driven updates to that range.",
      "acceptanceCriteria": [
        "In the UI scale settings popover, the slider minimum is 10 and maximum is 200.",
        "Dragging the slider cannot set uiScale below 10 or above 200 (value is clamped).",
        "The displayed label reflects the current uiScale value in percent."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/settings/UiScaleControl.tsx",
          "operation": "modify",
          "description": "Update MIN_SCALE/MAX_SCALE to 10/200, ensure Slider min/max match, and keep onValueChange clamping so slider interactions cannot push uiScale outside 10–200 while preserving the percent label display."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Adjust UI scale preset buttons to provide small/normal/large choices within the new 10%–200% range and keep slider in sync.",
      "acceptanceCriteria": [
        "The preset buttons only contain values between 10 and 200 inclusive.",
        "Clicking a preset sets the uiScale preference to that preset value and the slider updates accordingly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/settings/UiScaleControl.tsx",
          "operation": "modify",
          "description": "Replace PRESET_SCALES with a set of values spanning small/normal/large within 10–200 (inclusive), and ensure preset clicks route through the same clamping rules so state + slider value remain consistent."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Clamp persisted uiScale on load and on updates so out-of-range stored values never apply to the --ui-scale CSS variable.",
      "acceptanceCriteria": [
        "If localStorage contains an out-of-range uiScale value (e.g., 0 or 999), the app clamps it to the nearest valid value (10 or 200) and applies that clamped value to the UI scale CSS variable.",
        "No part of the app applies a --ui-scale value corresponding to less than 10% or greater than 200%."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/preferencesStorage.ts",
          "operation": "modify",
          "description": "Introduce a shared UI scale clamp helper and apply it when loading preferences from localStorage and when saving preferences, ensuring stored uiScale is normalized into the 10–200 range."
        },
        {
          "path": "frontend/src/context/PreferencesContext.tsx",
          "operation": "modify",
          "description": "Harden preference application by clamping uiScale before (a) saving updates and (b) applying the --ui-scale CSS variable, guaranteeing the DOM never receives a scale outside 10%–200% even if state is somehow corrupted."
        }
      ]
    }
  ]
}