{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Players' Documents sidebar + per-document privacy toggle",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a PLAYERS' DOCUMENTS section to the session sidebar that lists visible player-owned docs for the active session and supports selecting one to open.",
      "acceptanceCriteria": [
        "Session sidebar shows a new header \"PLAYERS' DOCUMENTS\" below \"Documents\".",
        "The section displays a list of player documents returned for the active session.",
        "Clicking a player document switches the main panel to that player document view."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/session/SessionSidebar.tsx",
          "operation": "modify",
          "description": "Add a new sidebar section labeled \"PLAYERS' DOCUMENTS\" below the existing \"Documents\" section; render the provided player documents list and invoke a new onSelectPlayerDocument handler when a player document is clicked. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SessionPage.tsx",
          "operation": "modify",
          "description": "Fetch the active session's player documents (via existing React Query hooks) and pass them into SessionSidebar along with selection state and callbacks so selecting a player doc can drive main-panel navigation. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Extend SessionPage selection state/navigation to support rendering player documents in the main panel using PlayerDocumentEditorView.",
      "acceptanceCriteria": [
        "SessionPage supports a third view type for player documents.",
        "Selecting a player document renders PlayerDocumentEditorView with the selected player document id.",
        "Switching between channel/shared document/player document updates the main panel accordingly without breaking existing channel/document behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SessionPage.tsx",
          "operation": "modify",
          "description": "Add a player-document view type (e.g., 'playerDocument') and selectedPlayerDocumentId state; wire sidebar selection so it updates viewType and selected ids, and render PlayerDocumentEditorView when a player document is selected while preserving existing channel/document behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/session/SessionSidebar.tsx",
          "operation": "modify",
          "description": "Extend props to include selectedPlayerDocumentId and onSelectPlayerDocument; ensure the correct button styling reflects player-document selection without affecting existing channel/document selection. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add an owner-only privacy toggle for player documents and ensure UI lists/visibility reflect the private state using existing backend capabilities.",
      "acceptanceCriteria": [
        "For the owner of a player document, the UI shows a clearly labeled checkbox/toggle: \"Private\" (or \"Hide from others\").",
        "Toggling the control updates the document’s visibility via the backend API and the UI reflects the new state.",
        "When a player document is Private, other session members cannot open it and do not see it listed in the \"PLAYERS' DOCUMENTS\" section.",
        "When a player document is not Private, other session members can open it; editing behavior matches the app’s intended permissions for non-owners (if non-owners are allowed to edit, edits persist; otherwise they are read-only)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/docs/PlayerDocumentEditorView.tsx",
          "operation": "modify",
          "description": "Add an owner-only \"Private\" (or \"Hide from others\") toggle using existing UI components (e.g., Switch/Checkbox) that calls the existing player-document visibility mutation; update rendering logic to use the correct backend field name (isPrivate) and gracefully handle non-owner access when the backend returns null/denied. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/usePlayerDocuments.ts",
          "operation": "modify",
          "description": "Align player-document hooks to the backend interface: use isPrivate naming (not visible) for create/update flows and update the setPlayerDocumentVisibility mutation to accept/send an isPrivate boolean; ensure query invalidation keeps sidebar + editor state consistent after toggling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx",
          "operation": "modify",
          "description": "Update create/visibility UI to use \"Private\" semantics (backed by isPrivate) rather than \"Visible to Others\"; ensure toggles/menus call the updated hook and reflect private state text/icons appropriately. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/session/SessionSidebar.tsx",
          "operation": "modify",
          "description": "Ensure the PLAYERS' DOCUMENTS list only renders documents returned as visible to the caller; optionally add an extra client-side guard to exclude private docs not owned by the current user (defense-in-depth) while relying on backend filtering for correctness. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}