{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Communities Hub: Remove (hide) My Communities with local persistence",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an accessible remove action with confirmation on each card in the \"My Communities\" grid and remove it immediately from the UI.",
      "acceptanceCriteria": [
        "Each card in the \"My Communities\" grid provides a clear remove action (e.g., a remove button/menu) that is accessible and does not interfere with the existing \"Open\" button.",
        "When the user triggers the remove action, the community is removed from the \"My Communities\" list immediately in the UI.",
        "A confirmation step is shown before removal to prevent accidental deletes (user-facing text must be in English)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CommunitiesHubPage.tsx",
          "operation": "modify",
          "description": "Add a per-card remove control (e.g., a small ghost/icon button with aria-label) in the \"My Communities\" cards that triggers an English confirmation step before hiding the card; update the rendered \"My Communities\" list immediately after confirmation without impacting the existing \"Open\" button layout/interaction. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Persist removed \"My Communities\" locally (localStorage) and restore/clear it via existing clear/reset local data flows.",
      "acceptanceCriteria": [
        "After removing one or more communities, reloading the app does not show the removed communities in \"My Communities\".",
        "Persistence is implemented entirely on the frontend (e.g., localStorage) without requiring backend changes.",
        "If local persistence is cleared (via existing clear/reset flows), the default \"My Communities\" list reappears."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/myCommunitiesHiddenStorage.ts",
          "operation": "create",
          "description": "Implement a small localStorage-backed helper for \"hidden my community ids\" (load/save/add/remove/clear) with basic JSON parsing guards and a dedicated storage key. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CommunitiesHubPage.tsx",
          "operation": "modify",
          "description": "Wire the hidden-ids storage into the page: initialize hidden ids on mount/render, filter the hardcoded MY_COMMUNITIES list accordingly, and on successful confirmation persist the newly hidden id so it stays hidden across refresh/reload. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/clearLocalAppData.ts",
          "operation": "modify",
          "description": "Add the new hidden-my-communities localStorage key to the app's existing clear/reset local data list so \"Clear Local Data\" restores the default \"My Communities\" list. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Scope removal behavior to only affect the \"My Communities\" section and keep \"Discover\" unchanged.",
      "acceptanceCriteria": [
        "Removing a community from \"My Communities\" does not change the \"Discover\" grid.",
        "The \"Discover\" list remains fully functional and renders the same items as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CommunitiesHubPage.tsx",
          "operation": "modify",
          "description": "Ensure filtering/removal logic is applied only to the MY_COMMUNITIES rendering path (e.g., filter only that array) and leave DISCOVER_COMMUNITIES rendering untouched; confirm the Discover grid continues to render the original items and behavior. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}