{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace host Documents UI with Members' Channels, preserve Player Document privacy toggle, and fix initializing hang (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove host-owned Documents from session navigation and UI entry points.",
      "acceptanceCriteria": [
        "The Session sidebar no longer renders a \"Documents\" section.",
        "The Session main panel no longer routes to or renders the host document editor view.",
        "No UI entry points remain for create/rename/delete/lock host documents."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/session/SessionSidebar.tsx",
          "operation": "modify",
          "description": "Remove the host \"Documents\" sidebar section and all related create/rename/delete/lock UI triggers (including DocumentManagementDialogs wiring) so host documents are no longer navigable."
        },
        {
          "path": "frontend/src/pages/SessionPage.tsx",
          "operation": "modify",
          "description": "Remove host-document selection state and rendering of DocumentEditorView so the main panel can no longer open the host document editor view."
        },
        {
          "path": "frontend/src/hooks/useSessionData.ts",
          "operation": "modify",
          "description": "Stop querying and exposing host documents/current document data (listDocuments/getDocument) to eliminate frontend-level routing/data dependencies on host documents."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add Members' Channels sidebar section that opens chat, distinct from host Channels list.",
      "acceptanceCriteria": [
        "Backend exposes APIs to list Members' Channels for a session and to create/rename/delete a Members' Channel.",
        "Frontend sidebar displays a \"Members' Channels\" section and selecting an item opens the chat view for that channel.",
        "Members' Channels are stored and returned independently from the existing host \"Channels\" list (no mixing in the UI)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSessionData.ts",
          "operation": "modify",
          "description": "Add a membersChannels query (using the existing backend capability to fetch membersChannels) and expose it alongside the existing host channels without mixing the two lists."
        },
        {
          "path": "frontend/src/components/session/SessionSidebar.tsx",
          "operation": "modify",
          "description": "Add a distinct \"Members' Channels\" section that renders membersChannels and supports selecting one to open chat, without merging it into the existing host \"Channels\" section."
        },
        {
          "path": "frontend/src/pages/SessionPage.tsx",
          "operation": "modify",
          "description": "Add selection state and view switching for Members' Channels so selecting one routes to the existing chat view with the selected members channel id."
        },
        {
          "path": "frontend/src/components/session/MembersChannelManagementDialogs.tsx",
          "operation": "create",
          "description": "Create Members' Channels management dialogs (create/rename/delete) mirroring the existing ChannelManagementDialogs UX but calling members-channel backend capabilities. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/session/SessionSidebar.tsx",
          "operation": "modify",
          "description": "Wire MembersChannelManagementDialogs into the \"Members' Channels\" section (create button and per-item menu) so Members' Channels are fully manageable from the sidebar. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Reflect Members' Channels permissions in the UI (create for any member; rename/delete for creator or host).",
      "acceptanceCriteria": [
        "A non-host session member can create a Members' Channel successfully.",
        "A non-host session member cannot rename/delete a Members' Channel they did not create (receives an error).",
        "The session host can rename/delete any Members' Channel.",
        "Only session members can list or access Members' Channels for that session."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/session/MembersChannelManagementDialogs.tsx",
          "operation": "modify",
          "description": "Implement UI-level gating: always show 'create' for session members; show rename/delete only when the current principal is the channel creator or the session host; display backend authorization failures as user-readable errors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/session/SessionSidebar.tsx",
          "operation": "modify",
          "description": "Pass session host identity/current identity context to Members' Channels item menus so rename/delete controls only appear when allowed; ensure unauthorized actions do not have UI entry points."
        },
        {
          "path": "frontend/src/pages/SessionPage.tsx",
          "operation": "modify",
          "description": "Ensure the session host detection and current identity checks are available to the sidebar and Members' Channels management wiring for correct permission gating."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Remove Players' Documents sidebar section and replace it with Members' Channels navigation without broken references.",
      "acceptanceCriteria": [
        "The sidebar no longer displays the header text \"Players' Documents\".",
        "The sidebar instead displays \"Members' Channels\" (user-facing text in English).",
        "No broken imports or references remain to the removed sidebar Player Documents section UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/session/SessionSidebar.tsx",
          "operation": "modify",
          "description": "Remove the Players' Documents sidebar section header and its list rendering, and ensure the sidebar instead contains a \"Members' Channels\" section with working navigation."
        },
        {
          "path": "frontend/src/pages/SessionPage.tsx",
          "operation": "modify",
          "description": "Remove the sidebar props and handlers that were dedicated to Players' Documents list rendering to prevent broken imports/references after sidebar changes."
        },
        {
          "path": "frontend/src/components/session/PlayerDocumentsDialog.tsx",
          "operation": "create",
          "description": "Add a non-sidebar access path for player documents (e.g., a modal dialog listing player documents with create/select actions) so player documents remain reachable while meeting the sidebar replacement requirement. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SessionPage.tsx",
          "operation": "modify",
          "description": "Wire PlayerDocumentsDialog into the Session UI (non-sidebar) to preserve player-document access paths while keeping the sidebar free of the removed Players' Documents section. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Ensure each player document has an owner-only privacy toggle that persists and refetches correctly.",
      "acceptanceCriteria": [
        "Player document UI contains a clearly labeled privacy toggle control in English (\"Private\" or \"Hide from others\").",
        "Toggling the control updates the document privacy state and the UI reflects the new state after refresh/refetch.",
        "When the current user is not the document owner, the privacy toggle is not editable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/docs/PlayerDocumentEditorView.tsx",
          "operation": "modify",
          "description": "Verify and, if needed, adjust the existing \"Private\" toggle to ensure it is clearly labeled, disabled for non-owners, calls the visibility mutation, and triggers a refetch/update so the new state is reflected after refresh/refetch."
        },
        {
          "path": "frontend/src/components/session/PlayerDocumentManagementDialogs.tsx",
          "operation": "modify",
          "description": "Ensure player-document creation and management surfaces a \"Private\" control where applicable and that toggle actions invalidate/refetch player-document lists so privacy state stays consistent across the UI."
        },
        {
          "path": "frontend/src/hooks/usePlayerDocuments.ts",
          "operation": "modify",
          "description": "Confirm the setPlayerDocumentVisibility mutation invalidates the correct queries (player document + lists/metadata) so toggling privacy is reflected after refresh/refetch."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Prevent the app from getting stuck on \"Initializing...\" and provide a recoverable error state when initialization fails.",
      "acceptanceCriteria": [
        "After login, the app exits the \"Initializing...\" screen without requiring a hard refresh.",
        "If initialization fails, the UI surfaces a recoverable error state rather than spinning indefinitely.",
        "Regression check: a normal login with no session restored lands on the Lobby page; a restored session lands on the Session page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Expose actor creation error/status (and a retry/refetch capability) so the UI can stop indefinite loading and present a recoverable error state when actor initialization fails. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust the initialization gating logic so post-login transitions cannot be blocked indefinitely by actor fetching; add a recoverable error UI when identity/actor/profile initialization fails (e.g., show error message with retry and 'Clear local data' actions). Use the selected 'authorization' component guidance for handling auth-related initialization and caching; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useUserProfile.ts",
          "operation": "modify",
          "description": "Ensure current-user profile fetching correctly reflects actor dependency/loading/error states (to avoid UI hangs or indefinite spinners after login). Use the selected 'authorization' component guidance for preventing profile setup modal flash and for handling backend traps gracefully; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}