{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add lightweight markup rendering to DocumentContentPreview",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Extend DocumentContentPreview to render centered, sized, heading, tiny, spoiler, and underlined lightweight markup in preview mode (including around [FILE:id:name] markers) without changing stored content.",
      "acceptanceCriteria": [
        "Given document content containing lines starting with \"[C] \", the preview displays those lines centered (e.g., using Tailwind text-center) while preserving line breaks.",
        "Given document content containing lines starting with \"[B] \", the preview displays those lines with noticeably larger font size than normal preview text.",
        "Given document content containing lines starting with \"# \", the preview displays those lines as an extra-large heading style (largest of the provided options).",
        "Given document content containing lines starting with \"-# \", the preview displays those lines as extra-small text (smaller than normal preview text).",
        "Given document content containing \"||spoiler text||\", the preview hides the spoiler text by default and reveals it on click/tap; the interaction is accessible via keyboard (e.g., focusable + Enter/Space) and does not affect non-spoiler text.",
        "Given document content containing \"__underlined__\" (including within a bullet like \"- __underlined__\"), the preview renders just the wrapped text underlined, leaving surrounding characters like \"- \" intact.",
        "File marker rendering remains unchanged: images still render inline; non-image files still render as attachment rows; and text segments around file markers still apply the new markup rules where applicable.",
        "No backend changes are required; the raw stored content remains exactly as typed, with markup applied only in preview rendering."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/documentPreviewMarkup.ts",
          "operation": "create",
          "description": "Add helper utilities to tokenize document preview content into line-aware tokens (text + file marker placeholders) and render lightweight preview markup for line prefixes ([C], [B], #, -#) and inline patterns (||spoiler||, __underline__) without mutating the original content."
        },
        {
          "path": "frontend/src/components/docs/DocumentContentPreview.tsx",
          "operation": "modify",
          "description": "Update preview rendering to be line-aware across mixed text and [FILE:id:name] markers: render each line with appropriate Tailwind styling for [C]/[B]/#/-# prefixes (removing the prefix only in preview), and render inline spoiler (click/tap + keyboard accessible reveal) and underline spans within text while preserving existing inline image rendering and attachment-row rendering for file markers."
        },
        {
          "path": "frontend/docs/regression-test-plan-player-document-uploads.md",
          "operation": "modify",
          "description": "Append manual regression checks for the new preview-only markup rules (center/big/heading/tiny/spoiler/underline) including cases where markup appears before/after [FILE:id:name] markers and in both session and player document preview modes."
        }
      ]
    }
  ]
}