{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Preview/Edit mode for session DocumentEditorView with inline file rendering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an Edit/Preview toggle in DocumentEditorView to switch between editable textarea and read-only preview UI with English labels.",
      "acceptanceCriteria": [
        "A control is visible in the document editor UI that toggles between Edit and Preview modes.",
        "When in Preview mode, the textarea is not shown and content cannot be edited.",
        "When in Edit mode, the current behavior remains unchanged (textarea editing, upload buttons, save button, etc.)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/docs/DocumentEditorView.tsx",
          "operation": "modify",
          "description": "Add local view-mode state and a toggle control labeled \"Preview\" / \"Edit\"; conditionally render the existing textarea + upload/save controls only in Edit mode, and render the new preview panel in Preview mode. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Create a minimal, scrollable preview renderer that parses [FILE:<id>:<filename>] markers and renders text + inline file items in reading order with preserved line breaks.",
      "acceptanceCriteria": [
        "Preview mode renders the full content in reading order (text segments interleaved with file elements).",
        "Multiline text is preserved (line breaks are visible) using standard HTML/text rendering approaches (no new libraries).",
        "File markers are detected using the existing marker format used by the editor (\"[FILE:id:filename]\") and are not shown verbatim in preview output.",
        "The preview area is scrollable within the editor panel."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/docs/DocumentContentPreview.tsx",
          "operation": "create",
          "description": "Implement a read-only preview component that splits document content using the existing marker regex format and renders interleaved text segments and file placeholder slots; ensure the preview container is scrollable and preserves newlines (e.g., whitespace-pre-wrap). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/docs/DocumentEditorView.tsx",
          "operation": "modify",
          "description": "Wire the new DocumentContentPreview into Preview mode rendering, passing the current content and the already-available document files lookup context. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Resolve each file marker in preview via documentFiles/fileMap and render images inline by direct URL or non-images as attachment rows with an Open file action; show placeholders when missing.",
      "acceptanceCriteria": [
        "For markers whose file reference exists and has mimeType starting with \"image/\", an inline <img> is rendered at that location using fileRef.file.getDirectURL(), sized to fit the editor width (contain-style behavior).",
        "For markers whose file reference exists but mimeType is not an image, an inline element shows the filename and an \"Open file\" action (e.g., link/button) that opens/downloads the file URL.",
        "For markers whose file reference cannot be found, preview renders a clear inline placeholder (e.g., \"File not found: <filename>\") at that position.",
        "No backend changes are required; all preview rendering uses already-available frontend data (documentFiles + file.getDirectURL())."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/docs/DocumentContentPreview.tsx",
          "operation": "modify",
          "description": "Use the existing documentFiles list (from useListDocumentFiles in the parent) and a fileMap (file ID -> file reference) to resolve markers; use the blob-storage ExternalBlob capability (file.getDirectURL()) to render inline images and to provide URLs for \"Open file\" actions; render a clear inline placeholder when a referenced file cannot be resolved. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/docs/DocumentEditorView.tsx",
          "operation": "modify",
          "description": "Ensure Preview mode passes documentFiles (or a derived fileMap) into DocumentContentPreview and hides the existing gallery/attachments sections (optional) to avoid duplicate rendering while keeping Edit mode unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Keep changes tightly scoped to session DocumentEditorView preview behavior without altering upload/save logic or other screens.",
      "acceptanceCriteria": [
        "No changes are made to backend Motoko canisters.",
        "No changes are made to PlayerDocumentEditorView or player-document management flows.",
        "Existing upload and save behaviors in DocumentEditorView continue to work as before in Edit mode."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/docs/DocumentEditorView.tsx",
          "operation": "modify",
          "description": "Limit modifications to adding the mode toggle and conditional rendering for preview vs edit; do not change existing upload/save handlers or backend calls, and avoid any edits to PlayerDocumentEditorView or unrelated UI areas. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/docs/DocumentContentPreview.tsx",
          "operation": "create",
          "description": "Keep the preview renderer self-contained and only used by DocumentEditorView so the change remains tightly scoped. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}