{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Session header: mobile-safe layout and reduced height",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Make the Session page header fully visible on phone screens with no clipping or horizontal overflow by changing only the SessionPage <header>.",
      "acceptanceCriteria": [
        "On a narrow/mobile viewport, the entire header content (Leave button, session name/ID/host label, Documents/Player Documents buttons, members count, logout icon) is visible without being cut off.",
        "Header content does not overflow horizontally; no element is partially off-screen.",
        "No unintended page-level horizontal scrolling is introduced by the header."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SessionPage.tsx",
          "operation": "modify",
          "description": "Adjust ONLY the <header> markup/styles to be mobile-safe: restructure into a responsive layout (e.g., stacked rows on small screens), add min-w-0 and text truncation for the session title/metadata, ensure action area wraps instead of overflowing, and prevent horizontal overflow (e.g., w-full, flex-wrap, overflow-hidden where appropriate). Keep all existing controls present and usable (Leave, Documents, Player Documents, members count, Logout)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Reduce the Session page header vertical height on mobile to reclaim space for the chat, by adjusting only header spacing/typography/layout in SessionPage.tsx.",
      "acceptanceCriteria": [
        "Compared to the current UI, the header occupies less vertical space on mobile (visibly shorter).",
        "The chat message list visibly gains vertical space equivalent to ~3 message bubbles (approximate, not pixel-perfect).",
        "No functional regressions: header buttons still work (Leave, Documents, Player Documents, Logout)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SessionPage.tsx",
          "operation": "modify",
          "description": "Reduce ONLY the header’s vertical footprint via tighter spacing/typography in the <header>: decrease vertical padding, reduce gaps, use smaller font sizes/line-heights for the title/subtitle on small screens, and compress button sizing/spacing (while keeping labels/icons readable and all controls accessible). Ensure the header remains fully visible and does not introduce horizontal scrolling."
        }
      ]
    }
  ]
}